[{
	"newsId": 5718128120,
	"url": "http://asbarez.com/165827/pacific-ballet-dance-theatre-to-the-best-of-khachaturian-at-alex-theater/",
	"summary": "Pacific Ballet Dance Theatre, originally named Media City Ballet, announced its formation on September 30th of 2001.\nPacific Ballet Dance Theatre attracts first-class talent from around the world, including Armenia, Asia, Russia, Mexico and Spain.\nPacific Ballet Dance Theatre boasts a large, varied repertoire and produces several major programs annually.\nTo learn more, please visit, www.pacificballetdancetheatre.comNatasha Middleton (Artistic Director/Choreographer, Pacific Ballet Dance Theatre) was born into a ballet legacy.\nRuben Tonoyan (Associate Director and Ballet Master for Pacific Ballet Dance Theatre and Choreographer) was a Soloist with the Armenian National Opera Ballet for 23 years.",
	"author": [],
	"src": "http://asbarez.com/",
	"title": "Pacific Ballet Dance Theatre to ‘The Best Of Khachaturian’ at Alex Theater",
	"keywords": ["armenian",
	"masquerade",
	"remember",
	"ballet",
	"pacific",
	"theatre",
	"theater",
	"music",
	"best",
	"alex",
	"khachaturian",
	"gayane",
	"dance"],
	"newsText": "BURBANK—Pacific Ballet Dance Theatre with artistic director, Natasha Middleton, will present “The Best of Khachaturian,” an evening of ballet and instrumental music written by iconic Armenian composer Aram Khachaturian including the famous “Saber Dance” and “Lezginka” from “Gayane,” as well as selections from “Spartacus” and “Masquerade,” and a new work entitled “Remember,” set to selections from the “Cello Concerto In E-Minor,” in memory of the Armenian Genocide. The performance will be presented at the Alex Theatre, 216 North Brand Boulevard, Glendale, on Sunday, September 17 at 5 p.m.\n\nNatasha Middleton, Artistic Director of Pacific Ballet Dance Theatre, said: “We are honored to close Pacific Ballet Dance Theatre’s 15th Anniversary Season with a tribute to the music of the beloved Armenian composer Aram Kahachaturian in our program, ‘The Best Of Khachaturian,’ which will include a new piece I am setting in memory of the Armenian Genocide, entitled ‘Remember.’”\n\nPrincipal Dancers will include: Inga Demetryan (of Redondo Beach) as Phrygia in “Spartacus;” Eduard Sargsyan (of Redondo Beach) in the title role of “Spartacus;” Elen Harutyunyan (of Tarzana) in the title role of “Gayane” and Principle in “Remember;” Grigori Arakelyan (of La Crescenta) as Arbenin in “Masquerade” and Principle in “Remember;” Alina Bormotova (of North Hollywood) as Nina in “Masquerade;” Alexander Fost (of Pasadena) as Prince Zeveditch in “Masquerade;” Natalie Grina (of Burbank) as The Baroness in “Masquerade” and Soloist in “Remember;” Edgar Nikolyan (of Glendale) as Armen in “Gayane;” Nataliia Leparova (of Sherman Oaks) as a Principle in “Masquerade;” and Oleg Leparovi (of Sherman Oaks) as a Principle in “Masquerade.”\n\nSoloist Dancers will include: Ashley Dawn Smith (of North Hollywood) in “Remember,” “Gayane” and “Masquerade;” Hannah Hart (of Sherman Oaks) in “Remember,” “Gayane” and “Masquerade;” Julie Teerlink Sanches (of Santa Clarita) Aerialist in “Masquerade” and Jacob Magana (of Los Angeles) in “Masquerade” and “Gayane.” Musetta Rubin (of Sherman Oaks) will appear as a Demi-Soloist in “Remember,” “Gayane” and “Masquerade.”\n\nCorps De Ballet members include: Chloe Verkinder (of Rancho San Margarita) in “Remember,” “Gayane” and “Masquerade;” Hagop Tanashian (of North Hills) in “Remember, “Gayane” and “Masquerade;” Razmig Tanashian (of North Hills) in “Remember,” “Gayane” and “Masquerade;” Raffi Bilemjian (of Granada Hills) in “Remember,” “Gayane” and “Masquerade;” Shoshana Mozlin (of Los Angeles) in “Masquerade” and “Gayane;” Elissa Brock (of Sun Valley) in “Masquerade” and “Gayane;” Devon Riesenbeck (of Burbank) in “Masquerade” and “Gayane;” Charlotte Harrop (of Burbank) in “Masquerade” and “Gayane;” Megan Vanderen (of Glendale) in “Masquerade” and “Gayane” and Patrick Fitzsimmons (of Santa Clarita) in “Remember,” “Gayane” and “Masquerade.”\n\nNatasha Middleton, along with Ruben Tonoyan, Associate Director and Ballet Master for Pacific Ballet Dance Theatre, will co-direct the performance.\n\nComposer Aram Khachaturian is known worldwide for his ballets, “Gayane” and “Spartacus,” the symphonic suite, “Masquerade” and his “Cello Suite In E-Minor.” The creation of these pieces not only raised Armenian national ballet to the world level, but also noticeably enriched the treasure house of the world musical-dramatic art. Khachaturian’s music is noted for its modal, harmonic, melodic and orchestral generosity, all of which are connected with a broad gamma of thoughts and feelings in his scores.\n\n“Gayane” means happiness and is a celebration of life events in which composer Aram Khachaturian wanted the folk songs and dancing melodies to be integrated and inseparable from the whole of the ballet. “Gayane” is the story of a young Armenian woman whose patriotic convictions are in conflict with her personal feelings upon discovering her husband has committed treason. The “Gayane” score includes the famous Saber Dance. The late filmmaker Stanley Kubrick used the Adagio from “Gayane” for his film, 2001: A Space Odyssey. Likewise, filmmaker Joel Coen used music from “Gayane” in his film, The Hudsucker Proxy.\n\nThe well-known tale of “Spartacus” is written in modern language, with application of contemporary methods of the musical-theatre form. The main characters in the ballet are represented with specific and repeated musical themes. The storyline concerns the ultimately unsuccessful revolt of the slaves led by Spartacus, a Thracian slave and gladiator, against the Roman Empire in the years 73 – 71 BC. Music from Khachaturian’s “Spartacus” was heard in the film, Ice Age: The Meltdown.\n\n“Masquerade” was written for the 25th anniversary of the Russian Revolution. It is a symphonic suite in the tradition of lavish classical Russian music. Natasha Middleton will stage the piece to enhance the fantasy and put a modern face on this elaborate party, featuring eccentric costuming. The plot concerns a missing bracelet and a woman named Nina who is falsely accused of giving the bracelet to Prince Zvezditch. As a result, Nina’s husband, who thinks she is cheating on him, poisons her at the end of the ballet, only to realize she was innocent. The bracelet had actually been stolen by the Baroness and given to the Prince, who later gave it back to Nina. Natasha Middleton said: “Theatergoers who enjoy Phantom of the Opera, will enjoy “Masquerade” as there are similarities in style.”\n\nAram Khacaturian wrote his “Cello Concerto In E-Minor” in 1946. It was the last of the three concertos he wrote for individual members of a renowned Soviet piano trio. The Concerto was premiered on October 30, 1946 in the Great Hall of the Moscow Conservatory, with dedicatee Sviatoslav Knushevitsky as soloist. The work is said to be representative of Khachaturian’s painful experience of wartime and contains many allusions to folk material and dance rhythms such as the ashough.\n\nTickets are $25, $35, $55, $65 and $125, which includes a VIP Pre-Performance Catered Reception on the Alex Theatre Terrace Lobby beginning at 3:30 p.m. The performance begins at 5:00 p.m. on Sunday, September 17, 2017. Tickets may be purchased online at www.alextheatre.org or ticketmicket.com or by calling the Alex Theatre Box Office at 818-243-2539 or Ticket Micket at 818-265-0506. Tickets are also on sale at the Concierge Desk at The Americana At Brand and the Glendale Community College Auditorium Box Office.\n\nPacific Ballet Dance Theatre, originally named Media City Ballet, announced its formation on September 30th of 2001. Over the past decade, the company has gained a notable following and has grown to become one of the major dance companies within the greater Los Angeles area. Pacific Ballet Dance Theatre attracts first-class talent from around the world, including Armenia, Asia, Russia, Mexico and Spain. Company dancers possess credentials of study and performance from such companies as Armenian National Opera Ballet, the Bolshoi Theatre Ballet, the Kirov Opera and Ballet Company, the Korean National Ballet, San Francisco Ballet, and Cirque du Soleil. Pacific Ballet Dance Theatre boasts a large, varied repertoire and produces several major programs annually. Educational outreach programs and performances are performed by PBDT’s youth ballet. PBDT believes dance is the perfect universal expression of the human spirit. By continuing the innovative heritage of the Ballet Russe de Monte Carlo, PBDT believes we are better able to understand our life stories, which elevates our passion and motivates us to express our true selves. PBDT performs captivating ballet presentations and offers engaging educational programs that nurture the talent and artistic creativity within the diverse Southern California Community. To learn more, please visit, www.pacificballetdancetheatre.com\n\nNatasha Middleton (Artistic Director/Choreographer, Pacific Ballet Dance Theatre) was born into a ballet legacy. Her grandmother, Elena Wortova, danced with the Ballet Russes, and her father, Andrei (Bill) Tremaine, with the Ballet Russe de Monte Carlo. She was a ballerina with the original Pacific Ballet Theatre, under the direction of her father. She trained and danced in Los Angeles and in New York with Joffrey II, as well as in Europe and Asia performing in such ballets as The Nutcracker, Raymonda, Spartacus, and Carmen. She is the daughter of former San Francisco Opera Soprano, Natalie Garrotto and the niece of the late film star, Yvonne de Carlo (Lily on The Munsters). With music and acting under her belt, Middleton performed in and choreographed many musicals, operas, television and theater plays. As an actress she studied in Los Angeles under film director Don Richardson. She traveled much of the world studying many forms of cultural dancing, art design and contemporary and classical theatre. Middleton began choreographing professionally on Broadway for Jazz artist Chick Corea and went on the World Tour with Chick Corea and Herbie Hancock. In 2001, she founded the Media City Ballet Company and staged numerous ballets in Los Angeles including Rachmaninov’s Piano Concerto #3. She has choreographed the feature film, Love Hurts with Carrie Anne-Moss and Richard E. Grant and such television shows as Hearts Afire with Billy Bob Thornton. She made history with her production of Men of the Ballet Russe honoring her father and other such Ballet Russe greats as Fredrick Franklin, Mark Platt, George Zoritch, Victor Moreno and Paul Maure. She established the Pacific Ballet Dance Theatre in 2012 (named after her father’s former company) and went on to direct three years of summer productions at the John Anson Ford Theatre with Axis Mundi, Dance in the USA and The British Beat. Her work placed as one of the Top 10 Dance Performances in California by the Beverly Hills Outlook. Her newest classical works are Chopin Pieces and the staging of Don Quixote. Middleton’s latest Contemporary works include: Black Coffee, Searching and the full length Carmen. Her latest short film can be seen on Watchable TV is Logan Paul vs Ballet.\n\nRuben Tonoyan (Associate Director and Ballet Master for Pacific Ballet Dance Theatre and Choreographer) was a Soloist with the Armenian National Opera Ballet for 23 years. He began his training at the age of eight with the Armenian National Academy of Ballet. He continued his training at the Kirov Ballet School and the Vaganova Academy in St. Petersburg, Russia. After graduation, he returned to his native Armenia where he danced numerous ballets, including the leading role in Khachaturian’s Gayane. He has since toured around the world performing in such ballets as Giselle, Carmen, Swan Lake, Othello and The Nutcracker. He has also performed with the National TV Contemporary Ballet for about 10 years. Tonoyan is a resident of Glendale, CA.\n\nAram Khachaturian (Composer) was a Soviet-Armenian composer whose works were often influenced by Armenian folk music. He was born on June 6, 1903 in Tbilisi, Georgia, Imperial Russia to a poor Armenian family. Although Khachaturian had almost no musical education, he showed such great talent that he was admitted to the Gnessin Institute where he studied cello, and in 1925, he entered composition class there. By 1929, he transferred to the Moscow Conservatory where he studied under Nikolai Myaskovsky. In the 1930s he married the composer Nina Makarova. By 1951, he became a professor at the Gnessin State Musical and Pedagogical Institute and the Moscow Conservatory. Aram Khachaturian, along with composers Sergei Prokofiev and Dmitri Shostakovich, became known as the so-called “titans” of Soviet music, each enjoying worldwide reputations as some of the leading composers of the 20th century. Aside from his ballets, Khachaturian was a prolific composer of a wide variety of music, including orchestral works, vocal scores, concertos and chamber music, to name a few. He died on May 1, 1978 in Moscow.",
	"collection_date": "Wed Aug 30 00:07:52 2017",
	"converted_collection_date": "08-30-2017 00:07:52",
	"publish_date": "2017-08-29 16:59:23+00:00"
},
{
	"newsId": 5718129591,
	"url": "http://asbarez.com/166256/senate-panel-adopts-anca-backed-measures-supporting-artsakh-and-armenia/",
	"summary": "“Congress is clearly turning the corner on both Turkey and Azerbaijan, with senior legislators, from both parties, openly confronting and officially sanctioning Erdogan and Aliyev for their undemocratic abuses and anti-American actions,” said ANCA Executive Director Aram Hamparian.\nThe Senate maintained parity in appropriated military assistance to Armenia and Azerbaijan.\nThe Trump budget request for Armenia, submitted in May of this year, envisioned $4 million in ESF, $1.5 million for International Narcotics Control and Law Enforcement, and $700,000 for Non-Proliferation, Antiterrorism, Demining and Related Programs.\nMilitary parity between Armenia and Azerbaijan was maintained in the Administration’s proposed budget with each receiving $600,000 for International Military Education and Training and cuts Foreign Military Financing to both countries.\nSenators Chris Van Hollen (D-MD) and Senate Appropriations Committee Vice-Chairman Patrick Leahy (D-VT) introduced a successful amendment to block the use of funds to facilitate the sale of weapons to President Erdogan’s Presidential Protection Directorate.",
	"author": [],
	"src": "http://asbarez.com/",
	"title": "Senate Panel Adopts ANCA-Backed Measures Supporting Artsakh and Armenia",
	"keywords": ["military",
	"artsakh",
	"senate",
	"aid",
	"adopts",
	"million",
	"azerbaijan",
	"turkey",
	"president",
	"panel",
	"foreign",
	"supporting",
	"armenia",
	"ancabacked",
	"committee",
	"measures"],
	"newsText": "Measures Sanction Ankara and Baku\n\nWASHINGTON – The full U.S. Senate Appropriations Committee yesterday adopted a series of Armenian National Committee of America (ANCA) supported provisions as part of its Fiscal Year 2018 (FY18) foreign aid bill, specifically calling for continued aid to Artsakh and increased assistance to Armenia ($20.7 million), and also imposing weapon and travel sanctions on Turkey and Azerbaijan.\n\n“Congress is clearly turning the corner on both Turkey and Azerbaijan, with senior legislators, from both parties, openly confronting and officially sanctioning Erdogan and Aliyev for their undemocratic abuses and anti-American actions,” said ANCA Executive Director Aram Hamparian. “We thank all those who worked to include these constructive provisions and look forward to remaining engaged in support of each of these issues as the legislative process moves forward.”\n\nThe Senate foreign aid bill’s “report,” which provides detailed legislative guidance for the executive branch, included language recommending: “assistance for victims of the Nagorno-Karabakh conflict in amounts consistent with prior fiscal years, and for ongoing needs related to the conflict. The Committee urges a peaceful resolution of the conflict.”\n\nIn terms of aid to Armenia, the Committee called for roughly a $14 million increase over the President’s proposed budget: $17.633 million in Economic Support and Development Fund (ESF), $1.5 million for battling narcotics trafficking, $600,000 for International Military Education and Training and $1 million in Foreign Military Financing. The Senate maintained parity in appropriated military assistance to Armenia and Azerbaijan. The Trump budget request for Armenia, submitted in May of this year, envisioned $4 million in ESF, $1.5 million for International Narcotics Control and Law Enforcement, and $700,000 for Non-Proliferation, Antiterrorism, Demining and Related Programs. Military parity between Armenia and Azerbaijan was maintained in the Administration’s proposed budget with each receiving $600,000 for International Military Education and Training and cuts Foreign Military Financing to both countries.\n\nThree key amendments targeted Turkey and Azerbaijan in response to the growing human rights abuses in each country, most notably the May, 2017, beating of peaceful protesters by Turkish President Erdogan’s bodyguards in Washington, DC.\n\nSenators Chris Van Hollen (D-MD) and Senate Appropriations Committee Vice-Chairman Patrick Leahy (D-VT) introduced a successful amendment to block the use of funds to facilitate the sale of weapons to President Erdogan’s Presidential Protection Directorate. Sen. Van Hollen told the Washington Post that the appropriations panel’s vote in support of the measure sent “a strong, bipartisan message: We are not going to let President Erdogan’s personal bodyguards attack peaceful American protesters on American soil — and we’re certainly not going to sell them weapons while they do it.”\n\nSenators James Lankford (R-OK) and Jeanne Shaheen (D-NH) introduced and passed an amendment to restrict U.S. travel visas to any senior official of the Government of Turkey who is knowingly responsible for the wrongful or unlawful prolonged detention of U.S. citizens or nationals. The move is widely viewed as being in response to Turkey’s continued imprisonment of Pastor Andrew Brunson, a North Carolina native who, for more than two decades, has ministered to the Izmir Resurrection Church in Turkey’s third largest city.\n\nSenate Assistant Democratic Leader Dick Durbin (D-IL) called for similar visa restrictions of Azerbaijani government officials involved with the “wrongful imprisonment of Mehman Aliyev, the director of Turan, Azerabaijan’s last remaining independent news outlet.” The Washington Post editorial board this week called for the Turan chief’s immediate release and noted that under President Aliyev’s reign, “a sustained and punishing campaign has been waged against dissenting scholars, human rights defenders and journalists.”",
	"collection_date": "Fri Sep  8 22:23:14 2017",
	"converted_collection_date": "09-08-2017 22:23:14",
	"publish_date": "2017-09-08 15:16:02+00:00"
},
{
	"newsId": 5718131162,
	"url": "http://asbarez.com/164468/lucky-breaks-a-visit-to-yereruyk-talin-and-dashtadem/",
	"summary": "As I leafed through the pages, I came across the Yereruyk and Talin cathedrals—two jewels of medieval Armenian art I had never visited.\nWhen the desire to see an Armenian church is stuck in my mind, it becomes my resolve to fulfill it.\nWhile I was putting on my socks, a car stopped in front of me.\nOn my way, a car stopped, and the driver once again began interrogating me,“Hey, young man!\n“Well, I can take you to a place where a car might go to Talin,” said the driver.",
	"author": [],
	"src": "http://asbarez.com/",
	"title": "Lucky Breaks: A Visit to Yereruyk, Talin and Dashtadem",
	"keywords": ["lucky",
	"driver",
	"breaks",
	"village",
	"talin",
	"came",
	"stopped",
	"yereruyk",
	"told",
	"car",
	"visit",
	"church",
	"asked",
	"dashtadem",
	"armenian"],
	"newsText": "BY ACHOD PAPASIAN\n\nOne day, I was hanging out at my friend Siuneh’s and found a book dedicated to Armenian architecture in her library.\n\nAs I leafed through the pages, I came across the Yereruyk and Talin cathedrals—two jewels of medieval Armenian art I had never visited. When the desire to see an Armenian church is stuck in my mind, it becomes my resolve to fulfill it. The evening before going on the trip, I discussed my upcoming adventure with dear friend Manouk, who suggested that I take the opportunity to also visit the Dashtadem fortress, an impressive yet little known monument located in the town of Talin. The next morning, a chilly winter day in February, I took the train heading to Gyumri, riding along the Turkish border. First stop: the Yereruyk basilica, located in the village of Anipemza, very close to the frontier.\n\nI got off at the Aniavan station, and rushed to a nearby shop to buy some supplies. The shopkeeper asked me suspiciously: “Where are you from? What are you doing here?” I explained in a few sentences and left.\n\nAs I started walking towards the next village, I realized the weather was much colder than in Yerevan, so I sat on a bench to put on a second layer of socks. On the other side of the street, a group of men were staring at me like I landed from Mars. Same interrogation: “What are you doing here?” A bit upset, I answered, “Hey, look at me, I am not a spy!”a riposte they all enjoyed with a laugh. While I was putting on my socks, a car stopped in front of me. “Come sit!” said the driver, “you’ll do that later.” I grabbed my stuff, sat in the back of the car, and told the driver I was heading to Anipemza to see the church. On the way, the car drove along barbwires delimiting the border of Armenia – literally five meters from us – and I could see a military base in the distance.\n\nThe driver dropped me close to the basilica. As soon as I got off the car, I was hit by a powerful blast of cold wind, which projected me into another dimension. The basilica stood at the stop of a plateau overlooking the Akhuryan canyon. The building, whose foundations date back to the 4th century, is one of the earliest surviving Christian monuments in Armenia. Although the roof is gone, the walls eroded by time still stand on several layers of stairs reminding me of pagan temples. The color of the stones, typical of the monuments of the region, was gorged with sun and warmth. Fragments of the church scattered all around, like a reminder of its former unity. Meanwhile, that vigorous wind was still blowing, hitting my thin body and those ancient walls, careless for borders.\n\nWhen I had my fill of admiring the church, I decided to take a stroll in the village and have a look at the canyon. On my way, a car stopped, and the driver once again began interrogating me,\n\n“Hey, young man! Where are you going?”\n\n“I am just taking a stroll, and then going to Talin,” I replied candidly.\n\n“Well, I can take you to a place where a car might go to Talin,” said the driver.\n\n“Perfect!” I thought, and sat in the front of the car. However, after driving a few minutes, I understood why my driver had been so obliging: he was in fact taking me to the military base! A soldier asked me to get off and began to flood me with questions.\n\n“Where are you from? Why did you come here? Don’t you know this is a military area? You cannot be here without permission!”\n\nHe then asked for my passport, but I didn’t have it with me.\n\n“That bloody driver has screwed my whole program!” I thought. Soon after, a Russian officer came up to me and asked me a ton of questions, with the soldier translating to Armenian. The only document attesting of my identity was my library card, which contained very little info. However, the Russian officer was reading it very seriously, especially the opening hours, as if some important info was to be found there. After checking my bag and my phone and asking some more absurd questions, the officer understood I was not dangerous and asked a villager to take me back to Aniavan. What a relief! In the car, the villager told me with sympathy: “Don’t worry, this is a normal thing. In bordering villages, anyone has the right to ask foreigners what they are doing here. It’s a border region, so everyone is very suspicious.” He then told me he was working in the stone cutting industry, like most locals, as the Shirak region is the main stone provider for the country.\n\nBack on the main road near Aniavan, my plan was now to hitchhike to Talin, a little city located 20 km inland, on the other side of several mountain ranges. From the moment I raised my thumb, I embarked on a series of hitchhiking adventures that began with two young locals working for the railway line. When I told them that I was from France, they immediately drove to a market to buy beers and celebrate the unbreakable union of Armenia and Diaspora. “We are a good people, brother! We always help each other!”, they repeated joyfully, while swearing at their boss. The second car, overloaded with Armenian brooms, comprised two men in their fifties. I didn’t take too long before the “copilot” offered me a shot of vodka and a sandwich. As we got acquainted, the driver asked me.\n\n“But why are you travelling alone?”\n\n“Well, I am not alone now!” I answered, to their greatest pleasure.\n\nSoon after, the car slowed down and stopped. We ran out of gas, in the middle of nowhere! The driver stood on the side of the road, waving at the passing cars for them to stop. Fifteen minutes later, a car eventually stopped and shared its gas with our vehicle. When we sat back in the car, the driver told me:\n\n“See! The Lord has helped us, because we helped you!”\n\nIn the next car, however, the atmosphere was completely different: a father and his son, were driving from Georgia, in a heavy silence. The father kept observing me in the rear view mirror, from behind his sunglasses. We eventually arrived at the crossroad near Talin. As I got off, the driver stopped me.\n\n“Hey, what about the money?”\n\n“Oh, you’re a taxi? Well, that wasn’t written anywhere!” I riposted, and shut the door. First time someone ever asked me for money while hitchhiking!\n\nI found my way to the cathedral, walking across muddy fields. When I reached the sanctuary, a crowd of people wearing black had gathered in the nearby cemetery. The cathedral made a deep impression on me, with its majestic and peaceful aura. Much of the building had been preserved, apart from the upper part of the dome and a significant portion of the western wing that had partially collapsed. Close to what was supposed to be the main entrance, an abandoned rail for stone cutting indicated that the church must have been renovated back in the days. From there, a surrealistic perspective opened before me – the superposition of walls crumbling into ruins, and elegant arches – a combination of abstract and figurative art. I wandered in and out of the church, contemplating its endearing stones, and walked away quietly, leaving the crowd of the funeral behind me.\n\nAfter asking the way to the Dashtadem fortress to an old man, I walked along a road stretching into fields overlooked by Mount Arteni. This time, I was less lucky with hitch hiking. The road was almost desert, and the few cars passing never stopped. Half an hour later, a car eventually stopped: a zhiguli packed with a family of villagers, including four children. With great kindness, they made room for me, even though it meant driving packed like sardines. On the way, the children and I exchanged knowing glances. In Armenia, you should always be ready to find a new family! They dropped me right in front of the ramparts entrance.\n\nThe fortress stood in the middle of a huge walled enclosure, surrounded by houses in very poor condition. The building itself was very different from what I had imagined: it was a strange mix of circular towers and straight fortifications. Interestingly, one of the walls bore an Arabic inscription which – as I later discovered – testified of the fact that Arabs added the towers to the already existing Armenian structure in the 12th century. The inside revealed a dark and confined space consisting of a large cistern and tunnels leading the top of the keep. Behind the fortress, a crumbling rampart opened on a gorgeous ocean of valleys, bathed in sunshine and covered with scattered stones, with a little chapel in the distance. While I was exploring, I encountered an old woman who took me to her neighbor’s house to have coffee. They still both lived within the enceinte, unlike the many local shepherds and their families who were displaced from the grounds because of ongoing renovations. As we got to meet each other, the old woman told me she was the great-granddaughter of the vartapet of Holy Apostles Monastery, a legendary monastery located in the province of Mush, in Western Armenia. Most people of the area fled the genocide perpetrated in the Eastern provinces of the Ottoman Empire and resettled in the Western provinces of the young Armenian Republic. Just like this old woman, their descendants can still be found there today.\n\nNoticing the late hour, I decided to head back to Yerevan, and said my farewells to the ladies. As I walked away from the entrance of the fortress, I heard someone calling me.\n\n“Hey, young boy! Where are you going?”\n\nI turned over to see a stout man in his forties, going down the stairs of his house. “Come in, we are having a party! You’re my guest!”\n\nBefore I could answer anything, he dragged me inside his home filled with guests, and invited me to sit around a huge table of thirty people. Everyone was starring at me, intrigued and amused, while Karen – my host – was filling the glasses with vodka.\n\n“Today is a very special day,” said a friend of the host. “We all gathered here to celebrate the death of Karen’s mother, and the birth of his third child. Earlier, we went to the cemetery and paid tribute to the old lady.” Incredible! That was the same “funeral” I saw near the Talin cathedral!\n\nAnother took over and said: “See, we are all Mshetsis. Our ancestors came from Moush. Have you heard of this place?”\n\n“Of course,” I said, “I’ve been there two years ago, when I was travelling in Western Armenia.”\n\nInstantly, I felt a sparkle in the guests’ eyes. As we got to know each other, I watched the scene being performed by those colorful characters: one was constantly raising toasts to everything, even though no one listened to him, another kept asking me which girl of the table I would marry, while another one, Mher, the only sober one, answered all my candid questions with calmness. Children ran everywhere, dishes were constantly refilled, and toasts came one after the other, in a dionysiac atmosphere.\n\n“Allright, young boy! Now it’s your turn to make a toast!” said a guy.\n\nI felt my heart drop. What could I say that was worthy of this party? To save my own skin, I looked into my heart and just said what I was feeling.\n\n“Well, I had read a lot about Mshetsis, and now that I am here among you, I can say for sure that truth is greater than fiction!”\n\nMy words struck the whole audience with emotion.\n\n“What a toast he just said! Apres, akhper jan!”, exclaimed Karen, as we all clinked our glasses together. The party carried on even more intensely, and I fully enjoyed the madness. At some point, however, the hour was getting late. I knew no one would allow me to leave, so I relied on Mher to take me out of this crazy feast.\n\nHere I was, on the road again, drunk as a skunk, under the spell of the Armenian magic! But the peak didn’t last very long. As I passed in front of a house, a furious village dog came out and started to chase me! I ran with all my strength, while waiving at the passing cars. One of them stopped and I rushed inside. Again, I entered another dimension: I instantly connected with the driver, Taron, a khatchkar carver from the neighboring village, who worked in Dashtadem. As we drove by a square renovated through the financing of the French-Armenian community, he said with pride that he carved a khatchkar to order for a French city. Before dropping me off at the Talin crossroads, he said: “Don’t worry, we’ll meet again!” His last words echoed in my mind in a strange way. I didn’t have a clue as to when or how we would meet again.\n\nA few days after this adventure, I was reading a book called “Moush, Sweet Moush” that my friend Nané gave me. The book, written by young Armenians and Turks in the framework of a Turkish-Armenian reconciliation project, focused on collecting memories related to the province of Moush. What a surprise to me when I came across an article about a certain Taron Muradyan, from the village of Irind! In the article, Taron was telling the story of his grandfather, Serob, who witnessed the killing of his brothers, sisters and parents at the age of 14.\n\n“Old people, women, children were driven into the church. The Turks and Kurds closed the door and set the building on fire. In the confusion, as people were screaming and falling over each other, he fell under the corpses. That is how he didn’t get burned. He only fainted. In the morning, when fresh air came through the crack of the door, he came to his senses, crawled out and ran away. Afterwards, he went to a close Kurdish friend, who ran the risk to hide him. From now on, he would be called Hassan, and would have to pretend to be deaf and dumb. One day, as he took the Kurd’s sheep to pasture, he saw a group of Armenian survivors in the village, mostly women and children. He walked among them and suddenly encountered his aunt’s daughter. She told him they would be leaving in the afternoon. He hesitated: he felt responsible for the Kurd’s sheep but was also afraid to stay. As he saw the survivors disappear over the horizon, he found a decision within him and joined the group.” I close the book, stunned by this incredible twist of fate.\n\nBut let’s come back to the Talin crossroads, where my friend Taron left me. As I waited for a car to stop, thumb up and my head in the sky, I felt my heart was about to burst. I felt the desire to live so intensely that my body would dissolve and that my last breath, carried by the wind, would blow in the hair of a future hitchhiker who, just like me, is in love with this land and its people.",
	"collection_date": "Thu Sep 21 19:05:36 2017",
	"converted_collection_date": "09-21-2017 19:05:36",
	"publish_date": "2017-06-21 14:29:25+00:00"
},
{
	"newsId": 5718132823,
	"url": "http://asbarez.com/167376/over-100-members-of-congress-back-passage-of-genocide-prevention-measure/",
	"summary": "In March, “The Promise” director and producer Terry George and Eric Esrailian, respectively, joined the ANCA in meetings with key House leaders.\nThese films, in addition to Joe Berlinger’s “Intent to Destroy”, Shant Mardirossian and George Billard’s “They Shall Not Perish”, and Micah Smith’s ‘Faithkeepers”, all released in the past year, have drawn unprecedented attention to the Armenian Genocide and its consequences.\nCongressional Armenian Caucus Co-Chairs Jackie Speier (D-CA) and Dave Trott (R-MI) have been vocal in rallying support for the human rights measure.\nRepresentatives David Trott (R-MI) and Adam Schiff (D-CA) are the lead authors of H.Res.220.\nGenocide prevention advocates interested in thanking resolution cosponsors or urging their U.S.",
	"author": [],
	"src": "http://asbarez.com/",
	"title": "Over 100 Members of Congress Back Passage of Genocide Prevention Measure",
	"keywords": ["100",
	"genocide",
	"trott",
	"hres220",
	"united",
	"members",
	"dca",
	"passage",
	"prevention",
	"congress",
	"representatives",
	"resolution",
	"measure",
	"armenian",
	"support",
	"cosponsors"],
	"newsText": "H.Res.220 Leverages Lessons of Armenian Genocide to Prevent Future Atrocities\n\nWASHINGTON—In the wake of the Armenian Genocide epic “The Promise,” on the eve of the national release of “Architects of Denial,” after a long summer of Congressional district meetings, and amid a renewed drive by Representatives Jackie Speier (D-CA), David Trott (R-MI) and their Armenian Caucus colleagues, the number of U.S. House cosponsors on H.Res.220 cleared one hundred this week, signaling growing support for passage of this bipartisan measure leveraging the lessons of the Armenian Genocide to prevent future atrocities across the Middle East and around the world, reported the Armenian National Committee of America.\n\n“We are gratified to see the growing bipartisan backing for the adoption of H.Res.220 and are encouraged that each of the top U.S. House leaders, from both sides of the aisle, have records of supporting honest American remembrance of the Armenian Genocide – from Speaker Ryan and Majority Leader McCarthy to Democratic Leader Pelosi and Democratic Whip Hoyer, as well, of course, Chairman Royce and Ranking Member Engel of the Foreign Affairs Committee,” said Aram Hamparian, Executive Director of the ANCA. “We look forward to supporting the ongoing efforts H.Res.220’s authors and cosponsors to secure its adoption by the full U.S. House.”\n\n“The Promise” and “Architects of Denial”’ – their Washington, DC premieres and the work of filmmakers to impact U.S. policy on the Armenian Genocide – have played a key role in challenging U.S. complicity in Ankara’s ongoing denial of the Ottoman Turkish government’s mass murder of over 2.5 million Armenians, Greeks and Assyrian/Chaldeans from 1915-1923. In March, “The Promise” director and producer Terry George and Eric Esrailian, respectively, joined the ANCA in meetings with key House leaders. Just last week, “Architects of Denial” Executive Producers Dean Cain and Montel Williams wrapped up a series of meetings with legislators in the run up to the October 6th release of their documentary. These films, in addition to Joe Berlinger’s “Intent to Destroy”, Shant Mardirossian and George Billard’s “They Shall Not Perish”, and Micah Smith’s ‘Faithkeepers”, all released in the past year, have drawn unprecedented attention to the Armenian Genocide and its consequences.\n\nThis growing spotlight on Turkey’s genocidal history and the ongoing aggression against Armenia and Artsakh by both Azerbaijan and Turkey have resonated with lawmakers, as seen during over 200 district meetings held by ANCA Western Region and Eastern Region local advocates this past summer, urging support for a myriad of Armenian American community concerns, including passage of H.Res.220 and the Senate Armenian Genocide Resolution, S.Res.136.\n\nCongressional Armenian Caucus Co-Chairs Jackie Speier (D-CA) and Dave Trott (R-MI) have been vocal in rallying support for the human rights measure. Rep. Speier recently led an educational and cultural trip to Armenia, coordinated through the Embassy of Armenia, joined by Armenian Caucus founder and Co-Chair Frank Pallone (D-NJ), Co-Chair David Valadao, and Representatives Anna Eshoo (D-CA), Tulsi Gabbard (D-HI) and Jim Sensenbrenner (R-WI). Representatives Gabbard, Pallone and Valadao also traveled to the Republic of Artsakh.\n\nU.S. Representatives David Trott (R-MI) and Adam Schiff (D-CA) are the lead authors of H.Res.220. This genocide prevention measure stresses that “proper commemoration and consistent condemnation of the Armenian Genocide will strengthen our international standing in preventing modern-day genocides,” and, building upon the 2016 official U.S. designation of an ISIS genocide against Middle East minorities, specifically calls for the following: “[T]he United States, in seeking to prevent war crimes, crimes against humanity, and genocide against Christians, Yezidis, Muslims, Kurds, and other vulnerable religious and ethnic groups in the Middle East, should draw upon relevant lessons of the United States Government, civil society, and humanitarian response to the Armenian Genocide, Seyfo, and the broader genocidal campaign by the Ottoman Empire against Armenians, Assyrians, Chaldeans, Syriacs, Greeks, Pontians and other Christians upon their biblical era homelands.”\n\nThe Senate, Armenian Genocide Resolution, S.Res.136, was introduced by Senator Robert Menendez (D-NJ) with the bipartisan support of Senators Ted Cruz (R-TX), Ed Markey (D-MA), and Tom Udall (D-NM) earlier this year on April 24th, the international day of commemoration of the Ottoman Turkish Government’s murder of over 1.5 million Armenians from 1915-1923. The resolution calls on the President to “work toward an equitable, constructive, stable, and durable Armenian-Turkish relationship that includes the full acknowledgment by the Government of the Republic of Turkey of the facts about the Armenian Genocide.” It goes on to urge that “the foreign policy of the United States reflects appropriate understanding and sensitivity concerning issues related to human rights, crimes against humanity, ethnic cleansing, and genocide documented in the United States record relating to the Armenian Genocide.” Other cosponsors of the measure include Senators Dianne Feinstein (D-CA), Cory Gardner (R-CO), Gary Peters (D-MI), Jack Reed (D-RI), Marco Rubio (R-FL), Chuck Schumer (D-NY), Debbie Stabenow (D-MI), Chris Van Hollen (D-MD), Elizabeth Warren (D-MA), Sheldon Whitehouse (D-RI), and Ron Wyden (D-OR).\n\nA full listing of cosponsors for H.Res.220 is provided below. Genocide prevention advocates interested in thanking resolution cosponsors or urging their U.S. Senators and Representatives to support passage of Armenian Genocide legislation can take action on the ANCA’s March to Justice Advocacy platform by visiting anca.org/preventgenocide\n\nGenocide Prevention Resolution (H.Res.220) – Cosponsors\n\n(listed in alphabetical order – updated as of 10/05/2017)\n\nPete Aguilar (D-CA)\n\nKaren Bass (D-CA)\n\nGus Bilirakis (R-FL)\n\nMike Bishop (R-MI)\n\nMichael Capuano (D-MA)\n\nSalud Carbajal (D-CA)\n\nTony Cardenas (D-CA)\n\nJoaquín Castro (D-TX)\n\nJudy Chu (D-CA)\n\nDavid Cicilline (D-RI)\n\nKatherine Clark (D-MA)\n\nYvette Clarke (D-NY)\n\nWilliam Clay (D-MO)\n\nMike Coffman (R-CO)\n\nJohn Conyers (D-MI)\n\nLou Correa (D-CA)\n\nJim Costa (D-CA)\n\nJoe Courtney (D-CT)\n\nKevin Cramer (R-ND)\n\nJoseph Crowley (D-NY)\n\nPeter DeFazio (D-OR)\n\nJeff Denham (R-CA)\n\nTed Deutch (D-FL)\n\nLloyd Doggett (D-TX)\n\nDaniel Donovan (R-NY)\n\nEliot Engel (D-NY)\n\nAnna Eshoo (D-CA)\n\nAdriano Espaillat (D-NY)\n\nJohn Faso (R-NY)\n\nJeff Fortenberry (R-NE)\n\nTulsi Gabbard (D-HI)\n\nRuben Gallego (D-AZ)\n\nJohn Garamendi (D-CA)\n\nTom Garrett (R-VA)\n\nJimmy Gomez (D-CA)\n\nJosh Gottheimer (D-NJ)\n\nLuis Gutierrez (D-IL)\n\nColleen Hanabusa (D-HI)\n\nJared Huffman (D-CA)\n\nSheila Jackson Lee (D-TX)\n\nMarcy Kaptur (D-OH)\n\nJoe Kennedy (D-MA)\n\nRo Khanna (D-CA)\n\nRuben Kihuen (D-NV)\n\nRaja Krishnamoorthi (D-IL)\n\nJames Langevin (D-RI)\n\nBrenda Lawrence (D-MI)\n\nBarbara Lee (D-CA)\n\nSander Levin (D-MI)\n\nJason Lewis (R-MN)\n\nJohn Lewis (D-GA)\n\nTed Lieu (D-CA)\n\nDaniel Lipinski (D-IL)\n\nZoe Lofgren (D-CA)\n\nAlan Lowenthal (D-CA)\n\nNita Lowey (D-NY)\n\nCarolyn Maloney (D-NY)\n\nSean Patrick Maloney (D-NY)\n\nDoris Matsui (D-CA)\n\nBetty McCollum (D-MN)\n\nJames McGovern (D-MA)\n\nGrace Meng (D-NY)\n\nJohn Moolenaar (R-MI)\n\nSeth Moulton (D-MA)\n\nJerrold Nadler (D-NY)\n\nGrace Napolitano (D-CA)\n\nRichard Neal (D-MA)\n\nRick Nolan (D-MN)\n\nDonald Norcross (D-NJ)\n\nDevin Nunes (R-CA)\n\nFrank Pallone (D-NJ)\n\nEdwin Perlmutter (D-CO)\n\nChellie Pingree (D-ME)\n\nJared Polis (D-CO)\n\nKathleen Rice (D-NY)\n\nJacky Rosen (D-NV)\n\nLucille Roybal-Allard (D-CA)\n\nEdward Royce (R-CA)\n\nTim Ryan (D-OH)\n\nLinda Sanchez (D-CA)\n\nJohn Sarbanes (D-MD)\n\nJanice Schakowsky (D-IL)\n\nAdam Schiff (D-CA)\n\nBrad Schneider (D-IL)\n\nBrad Sherman (D-CA)\n\nJohn Shimkus (R-IL)\n\nAlbio Sires (D-NJ)\n\nChristopher Smith (R-NJ)\n\nDarren Soto (D-FL)\n\nJackie Speier (D-CA)\n\nTom Suozzi (D-NY)\n\nEric Swalwell (D-CA)\n\nMark Takano (D-CA)\n\nDina Titus (D-NV)\n\nPaul Tonko (D-NY)\n\nDavid Trott (R-MI)\n\nNiki Tsongas (D-MA)\n\nDavid Valadao (R-CA)\n\nTimothy Walz (D-MN)\n\nMaxine Waters (D-CA)\n\nJohn Yarmuth (D-KY)",
	"collection_date": "Thu Oct  5 22:06:15 2017",
	"converted_collection_date": "10-05-2017 22:06:15",
	"publish_date": "2017-10-05 14:43:12+00:00"
},
{
	"newsId": 5718137557,
	"url": "http://asbarez.com/168240/us-senators-urge-trump-to-demand-erdogan-respect-human-rights/",
	"summary": "WASHINGTON ­– On Wednesday, U.S.\nSenators John McCain (R-AZ), Chairman of the Senate Armed Services Committee, and Bob Menendez (D-NJ), member of the Senate Foreign Relations Committee, led a bipartisan letter to President Trump today calling on the administration to urge Turkish President Tayyip Erdogan to stop harassing American diplomats, to respect human rights, and to uphold democratic values in Turkey.\nCiting several recent actions including the arbitrary arrest of several U.S. Consulate employees in Istanbul, the detention of top Amnesty International officials, the sentencing by a Turkish court of Wall Street Journal reporter Ayla Albayrak, and the brutal attack by Turkish security personnel of peaceful demonstrators protesting Erdogan’s visit to Washington, D.C., the senators urged President Trump to demand the Erdogan government respect human rights and the rule of law.\n“Erdogan and his allies have corroded Turkey’s democracy by mounting an assault on the rule of law, using sweeping state of emergency authorities to stifle fundamental rights including free speech, undermining the independence of the judiciary, and quashing any expressions of opposition,” wrote the senators.\nThe letter could be read here.",
	"author": [],
	"src": "http://asbarez.com/",
	"title": "US Senators Urge Trump To Demand Erdogan Respect Human Rights",
	"keywords": ["washington",
	"trump",
	"senators",
	"turkish",
	"rights",
	"president",
	"erdogan",
	"john",
	"demand",
	"human",
	"rule",
	"urge",
	"letter",
	"respect"],
	"newsText": "WASHINGTON ­– On Wednesday, U.S. Senators John McCain (R-AZ), Chairman of the Senate Armed Services Committee, and Bob Menendez (D-NJ), member of the Senate Foreign Relations Committee, led a bipartisan letter to President Trump today calling on the administration to urge Turkish President Tayyip Erdogan to stop harassing American diplomats, to respect human rights, and to uphold democratic values in Turkey.\n\nCiting several recent actions including the arbitrary arrest of several U.S. Consulate employees in Istanbul, the detention of top Amnesty International officials, the sentencing by a Turkish court of Wall Street Journal reporter Ayla Albayrak, and the brutal attack by Turkish security personnel of peaceful demonstrators protesting Erdogan’s visit to Washington, D.C., the senators urged President Trump to demand the Erdogan government respect human rights and the rule of law.\n\n“Erdogan and his allies have corroded Turkey’s democracy by mounting an assault on the rule of law, using sweeping state of emergency authorities to stifle fundamental rights including free speech, undermining the independence of the judiciary, and quashing any expressions of opposition,” wrote the senators. “We urge you to send a clear message to President Erdogan that the United States will not tolerate this type of behavior and that any cooperation must be based on a shared commitment to human rights and rule of law.”\n\nThe letter was co-signed by Senators Ben Cardin (D-MD), John Boozman (R-AR), Chris Van Hollen (D-MD), Marco Rubio (R-FL), Richard Durbin (D-IL), John Cornyn (R-TX), Chris Coons (D-DE), Martin Heinrich (R-NM), Edward Markey (D-MA), Tammy Baldwin (D-WI), Jeanne Shaheen (D-NH), and Bernard Sanders (I-VT).\n\nThe letter could be read here.",
	"collection_date": "Fri Oct 27 19:08:18 2017",
	"converted_collection_date": "10-27-2017 19:08:18",
	"publish_date": "2017-10-27 12:11:06+00:00"
},
{
	"newsId": 5718138196,
	"url": "http://asbarez.com/168484/anca-sponsored-conference-on-christians-in-the-middle-east-prioritizes-justice-for-the-armenian-genocide/",
	"summary": "The advocates were gathered for In Defense of Christians (IDC) 2017 Summit, “American Leadership and Securing the Future of Christians in the Middle East,” cosponsored by the Armenian National Committee of America (ANCA), The Philos Project, and The Institute on Religion and Democracy (IRD).\nAn IDC Summit supporter since its inception in 2014 and cosponsor since 2016, the ANCA lent its voice to a series of policy-driven panel discussions in the first two days of the conference.\nThe policy shift, long sought by the ANCA, IDC and a broad range of coalition partners and Congressional allies was announced Wednesday evening by Vice-President Mike Pence at the IDC 2017 National Advocacy Summit Fourth Annual Solidarity Dinner.\nArmenian faith leaders at the conference included His Eminence Archbishop Oshagan Choloyan, Prelate of the Prelacy of the Armenian Apostolic Church of Eastern USA, Rev.\nBerdj Jambazian, Minister of Union of the Armenian Evangelical Church of North America and Mr. Zaven Khanjian, Executive Director and CEO of the Armenian Missionary Association of America.",
	"author": [],
	"src": "http://asbarez.com/",
	"title": "ANCA-Sponsored Conference on Christians in the Middle East Prioritizes Justice for the Armenian Genocide",
	"keywords": ["east",
	"idc",
	"middle",
	"christians",
	"ancasponsored",
	"prioritizes",
	"meetings",
	"genocide",
	"justice",
	"conference",
	"anca",
	"2017",
	"armenian",
	"summit"],
	"newsText": "Three-Day IDC Summit Concludes with 400+ Meetings Across Capitol Hill\n\nWASHINGTON – Hundreds of Christian leaders, international religious freedom advocates, and human rights defenders held over 400 Congressional meetings calling on legislators to reject Turkey’s Armenian Genocide gag-rule and draw upon the lessons of this crime in preventing renewed atrocities against Christians and other at-risk religious minorities across the Middle East.\n\nThe advocates were gathered for In Defense of Christians (IDC) 2017 Summit, “American Leadership and Securing the Future of Christians in the Middle East,” cosponsored by the Armenian National Committee of America (ANCA), The Philos Project, and The Institute on Religion and Democracy (IRD).\n\nA video overview of the IDC 2017 Summit is available at:\n\nThe meetings, which included Christian clergy of many denominations and supporters of diverse nationalities and creeds, focused on the summit’s five-pronged advocacy agenda, including support of H.Res.220, a bipartisan measure seeks to apply the lessons of the Armenian Genocide in preventing new atrocities across the Middle East, as well as efforts to advance: security and stability in Lebanon; emergency relief for victims of genocide in Iraq and Syria; allies and accountability in the Middle East; and, legal punishment for ISIS, al-Qaeda and other perpetrators of genocide.\n\nImages from the meetings are available on the ANCA Facebook page.\n\nPrior to the Congressional visitations, a dozen Members of Congress joined with advocates to share their personal commitment to support the safety and security of the Middle East’s historic Christian communities and cited the importance of grassroots mobilization to advance those concerns. Among U.S. Representatives offering remarks were: Robert Aderholt (R-AL), Ron Estes (R-KS), Trent Franks (R-AZ), Glenn Grothman (R-WI), Andy Harris (R-MD), Ro Khanna (D-CA), Ruben Kihuen (D-NV), Jamie Raskin (D-MD), Keith Rothfus (R-PA), Brad Sherman (D-CA), Steve Stivers (R-OH), and Randy Weber (R-TX).\n\nAn IDC Summit supporter since its inception in 2014 and cosponsor since 2016, the ANCA lent its voice to a series of policy-driven panel discussions in the first two days of the conference. In a panel titled “Who Are America’s Allies and Enemies in the Middle East,” ANCA Executive Director Aram Hamparian offered a hard look at Turkey, calling for accountability for its ongoing denial of the Armenian Genocide, the escalating aggression at home and abroad, reaching the U.S. in May with the brutal beating of peaceful protesters in Washington DC by President Erdogan’s security detail and supporters.\n\nHamparian’s remarks are available on the ANCA Facebook page at:\n\nhttps://www.facebook.com/ancagrassroots/videos/10155225439571859/\n\nA highlight of the IDC 2017 Summit was the announcement that the U.S. will open a new channel of direct U.S. Agency for International Development (USAID) assistance, administered by faith-based groups and other non-government organizations, to help persecuted Christians and other at-risk Middle East populations. The policy shift, long sought by the ANCA, IDC and a broad range of coalition partners and Congressional allies was announced Wednesday evening by Vice-President Mike Pence at the IDC 2017 National Advocacy Summit Fourth Annual Solidarity Dinner.\n\n“We will no longer rely on the United Nations alone to assist persecuted Christians and minorities in the wake of genocide and the atrocities of terrorist groups,” announced Vice-President Pence. “The United States will work hand-in-hand from this day forward with faith-based groups and private organizations to help those who are persecuted for their faith. […] We stand with those who suffer for their faith because that’s what Americans have always done, because the common bond of our humanity demands a strong response.”\n\nHis Beatitude Moran Mor Bechara Boutros al-Rai, the Maronite Patriarch of Antioch and all the East and His Beatitude John Yazigi, Greek Orthodox Patriarch of Antioch and All the East had traveled from the Middle East to offer first-hand accounts of the plight of Christians in the region. Armenian faith leaders at the conference included His Eminence Archbishop Oshagan Choloyan, Prelate of the Prelacy of the Armenian Apostolic Church of Eastern USA, Rev. Berdj Jambazian, Minister of Union of the Armenian Evangelical Church of North America and Mr. Zaven Khanjian, Executive Director and CEO of the Armenian Missionary Association of America.",
	"collection_date": "Thu Nov  2 22:13:34 2017",
	"converted_collection_date": "11-02-2017 22:13:34",
	"publish_date": "2017-11-02 15:27:09+00:00"
},
{
	"newsId": 5718140254,
	"url": "http://asbarez.com/169226/three-apples-unparalleled-armenian-television-road-%d5%83%d5%a1%d5%b6%d5%a1%d5%ba%d5%a1%d6%80%d5%b0/",
	"summary": "Point and click your way to Armenian public television’s website or YouTube to enjoy a new series called Road / Ճանապարհ.\nMulti-platform Content for MillennialsThe Road / Ճանապարհ travel-food-discovery-reality-ecotourism television series premiered this fall on Armenia’s First Channel.\nThe inception of Road / Ճանապարհ was prompted when its protagonist, an American-Armenian, found himself in an existential angst many first, second or third generation diasporans are bound to confront.\nI never dreamt of performing or being a media personality,” says the star of Road / Ճանապարհ.\nI did not go to Armenian school, but I always knew I was Armenian.",
	"author": ["Paul Chaderjian"],
	"src": "http://asbarez.com/",
	"title": "Three Apples: Unparalleled Armenian Television: Road / Ճանապարհ",
	"keywords": ["ճանապարհ",
	"television",
	"unparalleled",
	"family",
	"armenia",
	"school",
	"father",
	"roffi",
	"road",
	"wanted",
	"apples",
	"armenian",
	"series"],
	"newsText": "BY PAUL CHADERJIAN\n\nPicture breathtaking, sweeping views of Armenia. Visualize panoramic landscapes of an historic place, populated for more than six thousand years. Imagine drone camera footage, a bird’s eye view of the country’s diverse and colorful geography, its mountains, valleys, rivers and lakes.\n\nBuckle your belts now. You’re about to journey to parts of a homeland that have never been this comprehensively filmed before. Your front row-seat to an unparalleled, first-person audio-visual experience is right in your living room or office.\n\nPoint and click your way to Armenian public television’s website or YouTube to enjoy a new series called Road / Ճանապարհ. It’s an engaging documentary series captured by multiple body-mounted, handheld and stabilized cameras. Turn up the volume to hear her ancient, salt-of-the-earth people, the villagers, her farmers and her youth.\n\nMulti-platform Content for Millennials\n\nThe Road / Ճանապարհ travel-food-discovery-reality-ecotourism television series premiered this fall on Armenia’s First Channel. Many fans say It’s by far the best reality television show produced in Armenia to date.\n\nThe inception of Road / Ճանապարհ was prompted when its protagonist, an American-Armenian, found himself in an existential angst many first, second or third generation diasporans are bound to confront. Like thousands of other immigrants and refugees or the progeny of displaced peoples, the 35-year-old, blond, blue-eyed star of the show confronted the mystery for the archetypical, often-hyphenated diasporan. He wanted to know what it meant to be an Armenian. He wondered how others connected with the homeland decades or hundreds of years after they emigrated or were forced to leave.\n\nBefore heading to his ancestors’ birthplace from his native U.S. state of Washington, Roffi Petrossian had always pondered how to explain the origins of his name to others. He wondered how a diasporan could teach his or her children to be Armenian and feel like an Armenian? He wanted to know what it was like to live in that place, experience its modern civilization, taste its foods and get to know the land and its people.\n\n“I originally came to Armenia to see the country with my own eyes, to better my Armenian language skills, so that I can continue the traditions and culture,” says Roffi. He found himself wanting to tell the story of Armenia when he met new people in Seattle, but he heard himself repeating the stories he had been told by relatives, who themselves had not been to Armenia.\n\n“The catalyst was going to an Armenian wedding in California and realizing I could not understand what people were saying. I couldn’t be part of the dinner table conversation. I saw wedding traditions that I didn’t know existed,” he says. The wedding celebration made him wonder what else he didn’t know about his people and his ancestry. The experience prompted him to think about traveling to Armenia and getting involved somehow.\n\nSpelling Roffi, explained by his mom “The reason your dad and I named you Roffi was that you were born when the first movie from the Rocky film franchise was released. We enjoyed it so much that we thought about the strength of that name. We decided the Armenian name Roffi was so close we’d name you Roffi, but spelled it R-O-F-F-I rather than R-A-F-I. We didn’t want you to go through school with Americans pronouncing it wrong, emphasizing the ‘ah’ sound.”\n\nBirthright Armenia\n\nA few months after his “aha” moment at the wedding he attended in Glendale, Roffi was on the ground in Yerevan, courtesy of Depi Hayk, Birthright Armenia. Depi Hayk is a volunteer organization, created by Edele Hovnanian, that offers part or full travel reimbursements for those of Armenian descent who are at least 21 years old. The amount of reimbursement is between fifty to one hundred percent depending on how long a participant volunteers in Armenia.\n\n“I purchased a one-way ticket, not with the intent to stay permanently, but to have the freedom to go back when I was ready, or my money ran out,” says Roffi. “After one year of volunteering, I wasn’t ready to go back. Luckily, I found work straight away as the chief gardener at the Boghossian Garden in Yerevan.” Known as Lovers’ Park, the 18th century park had been left in disrepair and was renovated and reopened in 2008, thanks to Swiss-Armenian philanthropist Albert Boghossian and Armenia Fund, the Hayastan All-Armenian Fund.\n\nAfter Roffi started his job at Lovers’ Park, he also was tapped to be a development advisor to the Clean Energy and Water Program administered by USAID, the U.S. agency responsible for distributing aid money to foreign countries. “I was also Chief Gardener at Nairian Cosmetics, at which point, I was working nights managing the indoor rock climbing gym, Boulder Town.\n\nMedia Celebrity\n\n“Back in the States, I was a horticulturalist and a gardener. I never dreamt of performing or being a media personality,” says the star of Road / Ճանապարհ. “In all honesty, I shy away from the spotlight, from attention, and to this day, I always feel a certain performance anxiety whenever I have to go in front of the camera.”\n\nRoffi says he’s been working since he was 16 and has done everything from waiting tables to tending bar and even telemarketing. He earned his bachelor’s degree in Design and Technology and worked as the manager of videography for a consumer research firm. He was tasked to work alongside anthropologists, sociologists and psychologists to understand people’s food purchasing habits. Those years of travel around the U.S., filming interviews and making short documentaries for their clients paid off when he landed in Armenia.\n\nAfter the global financial meltdown, Roffi lost his job at the consumer research firm. It was then he decided to returned to school to earn a second degree in Environmental Horticulture. Contacts he made at his university lead him to a job in his new field.\n\n“I did landscape design for the city of Seattle, designing and building rain gardens, special gardens using a mix of special soil, and plants adapted to tolerate both extreme wet and dry soil,” he says. “I designed systems that redirected rainwater that would normally fall onto impermeable surface to the garden, so that it can slowly infiltrate the soil profile and not overwhelm the water treatment facilities during periods of heavy rain.”\n\nThe star of Road / Ճանապարհ never imagined he would become a coveted celebrity when he decided to repatriate to his ancestral homeland. His journey toward stardom began slowly when he started hosting a show called Homesick at Home on the Van radio station.\n\n“I started doing some voice overs in English, here in Yerevan,” says Roffi. “Someone heard me speaking and said I had a great voice. So, I was recorded reading translated Armenian books for an international audience.”\n\nSoon Roffi found himself doing commercials on the radio and on television. Dozens of organizations and agencies tapped his voice and his image for their media and advertising campaigns. He says he was gardening at Lovers’ Park during the day and shooting commercials and films at nights and weekends.\n\n“One day at the Sharm Holding studio, a casting director saw me standing in the hall, and asked me to act as Jesus for an upcoming show,” he says. From there, another casting agent at another studio saw me, and so on and so forth.”\n\nOn the Road with Roffi\n\nRoffi’s avocation soon became his vocation when he decided he would commit full time to shooting a documentary exploring Armenia with Bars Media founder, filmmaker Vardan Hovhannisyan.\n\n“Armenia is approachable, warm, inviting, genetically and culturally homogenous, and yet naturally diverse and rich,” says Roffi. “There was no better way to show Armenia than to get out of the capital, and roam around through the countryside.”\n\nRoad / Ճանապարհ is a work of art and a work of love, a collaboration between Roffi, Bars Media and H1, Armenian Public Television.\n\n“In May of 2016, Vardan and I sat down to discuss the filming of me walking through Armenia,” says Roffi. “We waited for confirmation from H1 and started filming last June.” He says he hopes his new series will make Armenia-natives, Hayastancis proud of their country. “To make Spirkahays (diasporans) want to visit. And to make everyone else aware of the country and the natural beauty, both of the people, culture, and land.”\n\nRoffi, a rotating crew of three producers, three directors and twelve cameramen have shot the first 12-episode season of the show through late October. As Roffi walked from the republic’s southernmost border to its northern, he and his crew had a support vehicle in case emergency.\n\nProducers in Yerevan kept abreast of his travels and contacted villages and cities he traveled through ahead of his arrival. Roffi and his team spent a night in a villager’s home every ten days to recharge their batteries, record Roffi’s narration of the footage and upload their work to Bars Media in Yerevan.\n\nBehind the Scenes\n\nThe biggest takeaways from his journey around Armenia were about people’s generosity and the feeling of belonging. “I often felt like a long lost relative who finally came home,” Roffi says. “Everyone wanted to talk with me, sit down with me, share a story over food and drink. Everyone wanted to help however they could. This kind of generosity is something that I’ve only found in Armenia, even though I’ve traveled and lived in England, Canada, Australia, Norway and all of western Europe.”\n\nRoffi remembers his time in Kalar, a small village in the southern Syunik region. “I stumbled into a hidden and faraway village with no plans. I was greeted by the entire village. They were all telling me how to climb the tallest mountain in the region, even though each of their directions to the same mountain were different.”\n\nTwo young men from the village drove Roffi to the peak, where they collected edible herbs before returning home to eat homemade cheese, fresh greens and tea. “We sat in their humble village home, laughing, joking,” he says. “Then I fed their pigs and took selfies with the family.”\n\nAs he continued on from Syunik, the family he broke bread with sent him text messages, asking about his well-being and how much of his journey north had he completed. “To this day, we still talk,” he says.\n\n“I think the most difficult aspect was the fact that I always had a camera filming me for four months,” he says. “Physically, it was no problem. I’m relatively young and healthy. I’ve been hiking and camping all my life, and I have no problem sleeping on the floor or eating bread all day. But emotionally sharing every moment and being surrounded by people all the time, that was different, draining.”\n\nRoffi says he’s a private person and seeks alone time. Midway through the shoot, he and his team took time off for rest and recuperation. The break during his border-to-border walk also meant he could spend time with his future wife, a woman he met and fell in love with in Armenia.\n\nFamily Reaction\n\nRoffi says his father is proud of what he’s doing here in Armenia, how he repatriated with no connections and no family and how he has not just survived but thrived. “I know he would love to be in Armenia too,” he says.\n\nRoffi’s mother is also proud, he says. “She loves seeing what I’m posting on Facebook. She follows my adventures online. I don’t think it matters for either of them that it is in Armenia or anywhere else. They are proud of my accomplishments, happy to see me happy, even if it means being far away from them.”\n\nPetrossian Family History explained by Roffi “My father is full Armenian, born and raised in Tehran, Iran. At the age of 18, he moved to Seattle, Washington, to attend university. He held a number of jobs to pay his way through school, studied engineering and began a career in the aerospace industry. “My mother has British and French roots. She grew up in Virginia. Her father was an insurance salesman, who quit everything to move the entire family out to Washington state, build a farm and live off the land. My parents met in University. My mother learned Armenian for my father, and after they were married, my father brought his entire family from Iran to America. There were ten of us living in one house, only speaking Armenian. “There is a very small Armenian community in Seattle that my father helped in bringing together in the 1970s. They met once a month at the agump, the clubhouse in a rental building near the city of Bellevue. I did not go to Armenian school, but I always knew I was Armenian. I identified as Armenian, but I was clearly an American and really too different to fit into either. “My grandma would walk me to elementary school holding my hand. My lunch would be dolma and rice. It was nothing the other kids wanted to trade. And all I wanted was to be like them and eat a non-nutritious, store-bought Lunchable. I would come home to my grandma’s home cooked macarone. My family would drink coffee and read fortunes from the dried grounds collecting at the bottom of the cup. “At Armenian barbeques, newcomers would ask who the blonde haired blue-eyed kid was; I stood out. It was this dichotomy, these differences that always made me appreciate the strange, the misunderstood, and to treat all with respect, and to live with a constant sense of curiosity. “But I think these differences were difficult for my family, the old world and the new. My mother was a progressive American woman, with a poster of Rosie the Riveter on her wall. She worked like my father, and the expectations everyone had of what happy families look like were never met. “After years of arguing behind closed doors, my parents divorced. My father moved to England, and I went with him, having just graduated from high school. My brother, who is two years younger than me, stayed with my mother near Seattle. That was the end of childhood and adolescence. I’ve been on my own for the most part, since then.”\n\nThe Road Less Traveled\n\nRoffi Petrosian, the modern-day adventurer, says the hardest moments in shooting the series were as he was close to the border and getting ready to film the last shots of his journey. “I knew I was close to finishing, close to being free. The seconds just kept ticking away, and I knew I had to film that one last shot. That was the hardest moment.”\n\nFor each 30-minute episode, the team shot about 15 hours of raw video, which included interviews Roffi conducted with people he met on his way through the countryside or in villages where he stayed.\n\nRoffi’’s narration came from journals he kept in English. The first airing of the series is in Armenian with English subtitles, but the team is preparing an English version for mass distribution.",
	"collection_date": "Wed Dec 13 00:31:08 2017",
	"converted_collection_date": "12-13-2017 00:31:08",
	"publish_date": "2017-12-12 13:39:16+00:00"
},
{
	"newsId": 5718144340,
	"url": "http://www.chicoer.com/arts-and-entertainment/20170819/comedian-civil-rights-activist-dick-gregory-dies",
	"summary": "LOS ANGELES (AP) \u0097 Dick Gregory, the comedian and activist and who broke racial barriers in the 1960s and used his humor to spread messages of social justice and nutritional health, has died.\nGregory died late Saturday in Washington, D.C. after being hospitalized for about a week, his son Christian Gregory told The Associated Press.\nDemocratic Sen. Cory Booker of New Jersey tweeted, \"Dick Gregory's unflinching honesty & courage, inspired us to fight, live, laugh & love despite it all.\"\nAn admirer of Gandhi and Martin Luther King Jr., Gregory embraced nonviolence and became a vegetarian and marathon runner.\nThe nation was grappling with the civil rights movement, and it was not at all clear that racial integration could be achieved.",
	"author": ["Daisy Nguyen",
	"Associated Press"],
	"src": "http://www.chicoer.com/",
	"title": "Comedian, civil rights activist Dick Gregory dies",
	"keywords": ["dies",
	"comedy",
	"peace",
	"gregory",
	"racial",
	"went",
	"activist",
	"rights",
	"standup",
	"late",
	"comedian",
	"dick",
	"civil",
	"social",
	"white"],
	"newsText": "LOS ANGELES (AP) \u0097 Dick Gregory, the comedian and activist and who broke racial barriers in the 1960s and used his humor to spread messages of social justice and nutritional health, has died. He was 84.\n\nGregory died late Saturday in Washington, D.C. after being hospitalized for about a week, his son Christian Gregory told The Associated Press. He had suffered a severe bacterial infection.\n\nAs one of the first black standup comedians to find success with white audiences, in the early 1960s, Gregory rose from an impoverished childhood in St. Louis to win a college track scholarship and become a celebrated satirist who deftly commented upon racial divisions at the dawn of the civil rights movement.\n\n\"Where else in the world but America,\" he joked, \"could I have lived in the worst neighborhoods, attended the worst schools, rode in the back of the bus, and get paid $5,000 a week just for talking about it?\"\n\nAdvertisement\n\nGregory's sharp commentary soon led him into civil rights activism, where his ability to woo audiences through humor helped bring national attention to fledgling efforts at integration and social equality for blacks.\n\nDemocratic Sen. Cory Booker of New Jersey tweeted, \"Dick Gregory's unflinching honesty & courage, inspired us to fight, live, laugh & love despite it all.\" A tweet by actress/comedian Whoopi Goldberg said, \"About being black in America Dick Gregory has passed away, Condolences to his family and to us who won't have his insight 2 lean on R.I.P\"\n\nGregory briefly sought political office, running unsuccessfully for mayor of Chicago in 1966 and U.S. president in 1968, when he got 200,000 votes as the Peace and Freedom party candidate. In the late '60s, he befriended John Lennon and was among the voices heard on Lennon's anti-war anthem \"Give Peace a Chance,\" recorded in the Montreal hotel room where Lennon and Yoko Ono were staging a \"bed-in\" for peace.\n\nAn admirer of Gandhi and Martin Luther King Jr., Gregory embraced nonviolence and became a vegetarian and marathon runner.\n\nHe preached about the transformative powers of prayer and good health. Once an overweight smoker and drinker, he became a trim, energetic proponent of liquid meals and raw food diets. In the late 1980s, he developed and distributed products for the popular Slim-Safe Bahamian Diet.\n\nWhen diagnosed with lymphoma in 2000, he fought it with herbs, exercise and vitamins. It went in remission a few years later.\n\nHe took a break from performing in comedy clubs, saying the alcohol and smoke in the clubs were unhealthy and focused on lecturing and writing more than a dozen books, including an autobiography and a memoir.\n\nGregory went without solid food for weeks to draw attention to a wide range of causes, including Middle East peace, American hostages in Iran, animal rights, police brutality, the Equal Rights Amendment for women and to support pop singer Michael Jackson when he was charged with sexual molestation in 2004.\n\n\"We thought I was going to be a great athlete, and we were wrong, and I thought I was going to be a great entertainer, and that wasn't it either. I'm going to be an American Citizen. First class,\" he once said.\n\nRichard Claxton Gregory was born in 1932, the second of six children. His father abandoned the family, leaving his mother poor and struggling. Though the family often went without food or electricity, Gregory's intellect and hard work quickly earned him honors, and he attended the mostly white Southern Illinois University.\n\n\"In high school I was fighting being broke and on relief,\" he wrote in his 1963 book. \"But in college, I was fighting being Negro.\"\n\nHe started winning talent contests for his comedy, which he continued in the Army. After he was discharged, he struggled to break into the standup circuit in Chicago, working odd jobs as a postal clerk and car washer to survive. His breakthrough came in 1961, when he was asked to fill in for another comedian at Chicago's Playboy Club. His audience, mostly white Southern businessmen, heckled him with racist gibes, but he stuck it out for hours and left them howling.\n\nThat job was supposed to be a one-night gig, but lasted two months -- and landed him a profile in Time magazine and a spot on \"The Tonight Show.\"\n\nVogue magazine, in February 1962, likened him to Will Rogers and Fred Allen: \"bright and funny and topical ... (with) a way of making the editorials in The New York Times seem the cinch stuff from which smash night-club routines are rightfully made.\" ''I've got to go up there as an individual first, a Negro second,\" he said in Phil Berger's book, \"The Last Laugh: The World of Stand-up Comics.\" ''I've got to be a colored funny man, not a funny colored man.\"\n\nHis political passions were never far from his mind -- and they hurt his comedy career. The nation was grappling with the civil rights movement, and it was not at all clear that racial integration could be achieved. At protest marches, he was repeatedly beaten and jailed.\n\nHe remained active on the comedy scene until recently, when he fell ill and canceled an August 9 show in San Jose, California, followed by an August 15 appearance in Atlanta. On social media, he wrote that he felt energized by the messages from his well-wishers, and said he was looking to get back on stage because he had a lot to say about the racial tension brought on by the gathering of hate groups in Virginia.\n\n\"We have so much work still to be done, the ugly reality on the news this weekend proves just that,\" he wrote.\n\nHe is survived by his wife, Lillian, and 10 children.",
	"collection_date": "Tue Aug 22 21:51:52 2017",
	"converted_collection_date": "08-22-2017 21:51:52",
	"publish_date": "2017-08-19 00:00:00"
},
{
	"newsId": 5718144452,
	"url": "http://www.chicoer.com/social-affairs/20170817/college-handbook-message-from-chico-states-president",
	"summary": "The year will be full of events to spark curiosity, drive conversation and celebrate the Chico Experience.\nI encourage our students, faculty, staff, campus visitors and all of the north state community to find a way to take part in our diverse offerings of education and entertainment.\nBeyond the scope of our traditional entertainment offerings, we look to engage the campus and community in other activities.\nI love these opportunities to meet our students, hear their stories and let them know what a supportive community Chico State is and the value we place on the individual experience as a contribution to our whole.\nJoin us for a performance, lecture, reception, game or one of the many other offerings that help drive the Chico Experience.",
	"author": ["Gayle E. Hutchinson",
	"Chico State University President"],
	"src": "http://www.chicoer.com/",
	"title": "College Handbook: Message from Chico State’s president",
	"keywords": ["states",
	"campus",
	"president",
	"chico",
	"students",
	"state",
	"faculty",
	"handbook",
	"community",
	"celebrate",
	"offerings",
	"experience",
	"university",
	"college",
	"message"],
	"newsText": "It’s with great excitement and anticipation that I look forward to the 2017-18 academic year.\n\nBound to be filled with remarkable achievements by our faculty, staff and students, national recognition of our people and programs, and exceptional hands-on learning and research that matters, the start of a new school year is always full of promise and opportunity.\n\nOur agenda for the year is aspirational, as we tackle reaccreditation by Western Association of School and Colleges, updating our campus master plan and initiating the process to establish a new university strategic plan. We welcome more than 17,500 students onto our campus, as well as 2,300 faculty and staff, and hope to be a hub for the community to come together as we stimulate our intellectual and creative minds.\n\nThe year will be full of events to spark curiosity, drive conversation and celebrate the Chico Experience. I encourage our students, faculty, staff, campus visitors and all of the north state community to find a way to take part in our diverse offerings of education and entertainment.\n\nI am particularly eager to start thumbing through the pages of this year’s Book in Common. Selected by a contingent of community members, “A Deadly Wandering” tells a powerful story and serves as a reminder to be safe on the road. We have much to look forward to as we celebrate this shared community read, including a lecture by visiting author Matt Richtel as he showcases what technology is doing to our brains through a true story about texting and driving.\n\nChico Performances, the School of the Arts, North State Symphony and our many museums and galleries will present what is perhaps the most expansive lineup in our history to enrich and engage our community. From lectures and operas to field trips and concerts, there are offerings to delight all ages, from the young or young at heart to more senior souls. I can affirm that no experience is quite like sitting in historic Laxson Auditorium or surrounded by the wood-paneled walls of the Zingg Recital Hall in a celebration of sound and supreme talent.\n\nMusic greats like Emmylou Harris and Kris Kristofferson will grace our stages this year, as well as favorites such as “A Very Chico Nutcracker,” “A Midsummer Night’s Dream” and “Pink Martini.” The selection is truly a global experience, from the Spanish Harlem Orchestra and La Santa Cecilia Mexrrissey to Dublin Irish Dance and the Chico World Music Festival.\n\nAnd, of course, we’ll celebrate the talent that calls our campus home, including our choral ensembles, theater majors, student composers and world-class faculty in an array of shows all year long.\n\nAdvertisement\n\nOn a more subdued level, curator’s talks at the Janet Turner Print Museum will bring meaning and intimacy to the exceptional works featured on its walls and in its collections. Our Master of Fine Arts candidates will showcase their creativity during thesis exhibitions in the Jacki Headley University Art Gallery, which will also host the 63rd annual Juried Student Exhibition in the spring. Gateway Science Museum’s rotating exhibits have something to offer learners of all ages, with this year’s programs featuring the human brain and microbiome, and the Valene L. Smith Museum of Anthropology will provide a window into the world with its exhibits on Indonesia, Vietnam and Japan.\n\nBeyond the scope of our traditional entertainment offerings, we look to engage the campus and community in other activities. Our multicultural welcome receptions at the semester’s start celebrate new students and offer an opportunity to network and build alliances with those who understand similar experiences, whether identifying as foster youth, veterans, LGBTQ+ or various ethnic groups.\n\nI love these opportunities to meet our students, hear their stories and let them know what a supportive community Chico State is and the value we place on the individual experience as a contribution to our whole.\n\nI would be remiss not to mention our award-winning athletics programs. What better way to fire up the Wildcat spirit than cheering from the stands of Acker Gym or the bleachers of University Stadium as any one of our Division II teams take on teams from around the country? Boasting titles in both the National Collegiate Athletic Association and California Collegiate Athletic Association, our top talent is something to behold, as I know we will doggedly pursue new championships and rankings in 2017-18.\n\nTogether, let’s embrace these events as a platform for expression and exploration, one that enhances our intellectual richness, fuels the creative spirit and celebrates the close-knit character of our community. Join us for a performance, lecture, reception, game or one of the many other offerings that help drive the Chico Experience. I’ll see you soon!",
	"collection_date": "Tue Aug 22 21:53:28 2017",
	"converted_collection_date": "08-22-2017 21:53:28",
	"publish_date": "2017-08-17 00:00:00"
},
{
	"newsId": 5718144547,
	"url": "http://www.chicoer.com/general-news/20170818/police-say-attacks-in-spain-are-linked-took-long-time-to-plan",
	"summary": "Armed police officers patrol a deserted street in Las Ramblas, in Barcelona, Spain, Friday, Aug. 18, 2017.\nPolice also arrested four others believed linked to the Cambrils attack and the carnage Thursday on a famous Barcelona promenade.\nBarcelona’s Las Ramblas is one of the most popular attractions in a city that swarms with foreign tourists in August.\nSpanish public broadcaster RTVE and other news outlets named one of those detained in the Barcelona attack as Driss Oukabir, a French citizen of Moroccan origin.\nSpanish media said documents with his name were found in the attack van and that he claimed his brother might have stolen them.",
	"author": ["Joseph Wilson",
	"Ciaran Giles",
	"Barry Hatton",
	"Associated Press"],
	"src": "http://www.chicoer.com/",
	"title": "Police say attacks in Spain are linked, took long time to plan",
	"keywords": ["say",
	"van",
	"plan",
	"group",
	"attacks",
	"linked",
	"attack",
	"las",
	"ramblas",
	"spain",
	"long",
	"barcelona",
	"cambrils",
	"killed",
	"took",
	"wounded"],
	"newsText": "Armed police officers patrol a deserted street in Las Ramblas, in Barcelona, Spain, Friday, Aug. 18, 2017. (AP Photo/Manu Fernandez)\n\nBARCELONA, Spain — The back-to-back vehicle attacks in Barcelona and a nearby resort had been planned for a long time by an Islamic terrorist cell — and could have been far deadlier had its base not been destroyed by an apparently accidental explosion this week, Spanish officials said Friday.\n\nPolice intensified their manhunt for an unknown number of suspects still on the loose Friday. They shot and killed five people early Friday who were wearing fake bomb belts as they attacked the seaside resort of Cambrils with a speeding car. Police also arrested four others believed linked to the Cambrils attack and the carnage Thursday on a famous Barcelona promenade.\n\nThe number of victims stood at 13 dead and 120 wounded in Barcelona, and one dead and five wounded in Cambrils. Sixty-one people wounded by the van in Barcelona remained hospitalized on Friday, with 17 of them in critical condition.\n\nAuthorities said the two attacks were related and the work of a large terrorist cell that had been plotting attacks for a long time from a house in Alcanar, 200 kilometers (124 miles) down the coast from Barcelona. The house was destroyed by an explosion of butane gas on Wednesday night that killed one person.\n\nSenior police official Josep Lluis Trapero said police were working on the theory that the suspects were preparing a different type of attack, using explosives or gas, and that the apparently accidental explosion prevented them from carrying out a far more deadly rampage.\n\nThe Islamic State group quickly claimed responsibility for Europe’s latest bout of extremist violence, in which a van roared down Barcelona’s historic Las Ramblas promenade on Thursday. Hours later, a blue Audi plowed into people in the popular seaside town of Cambrils.\n\nSpanish Prime Minister Mariano Rajoy declared Friday that the fight against terrorism was a global battle and Europe’s main problem.\n\nPolice said they arrested two more people Friday, after an initial two were arrested Thursday — three Moroccans and one Spaniard, none with terrorism-related records. Three of them were nabbed in the northern town of Ripoll. Another arrest was made in Alcanar.\n\n“We are not talking about a group of one or two people, but rather a numerous group,” regional Interior Ministry chief Joaquim Forn told Onda Cero radio.\n\nAdvertisement\n\nAmid heavy security, Barcelona tried to move forward Friday, with its iconic Las Ramblas promenade quietly reopening to the public and King Felipe VI and Rajoy joining thousands of residents and visitors in observing a minute of silence in the city’s main square.\n\n“We are not afraid! We are not afraid!” the crowd chanted in Catalan and Spanish.\n\nBut the dual attacks unnerved a country that hasn’t seen an Islamic extremist attack since 2004, when al-Qaida-inspired bombers killed 192 people in coordinated assaults on Madrid’s commuter trains. Unlike France, Britain, Sweden and Germany, Spain has largely been spared, thanks in part to a crackdown that has netted some 200 suspected jihadis in recent years.\n\nAuthorities were still reeling from the Barcelona van attack when police in the popular seaside town of Cambrils, 130 kilometers (80 miles) to the south, fatally shot five people near the town’s boardwalk who had plowed into tourists and locals with their car. Forn said the five were wearing fake bomb belts.\n\nOne woman in Cambrils died Friday from her injuries, Catalan police said. Five others were injured.\n\nCambrils Mayor Cami Mendoza said the town had taken precautions after the Barcelona attack, but the suspects focused their attack on the narrow path to the boardwalk, which is usually packed.\n\n“We were on a terrace,” said bystander Jose Antonio Saez. “We heard the crash and intense gun shots, then the dead bodies on the floor, shot by the police.”\n\nOthers described scenes of panic, and found safety inside bars and restaurants until police had secured the area.\n\nResident Markel Artabe was heading out to get an ice cream when he heard the shots.\n\n“We began to run. We saw one person lying on the pavement with a shot in his head, then 20 to 30 meters farther on we saw two more people, who must have been terrorists as they had explosive belts around them,” he said. “We were worried so we hid.”\n\nRegional police say the Cambrils suspects, armed with knives and an ax, wounded one person in the face with a knife before they were killed by police.\n\nThe Cambrils attack came hours after a white van mowed down pedestrians on Barcelona’s picturesque Las Ramblas promenade, leaving victims sprawled across the street, spattered with blood and writhing in pain from broken limbs. Others were ushered inside shops by officers with guns drawn or fled in panic, carrying young children in their arms.\n\n“It was clearly a terror attack, intended to kill as many people as possible,” Trapero said.\n\nThe Islamic State group said on its Aamaq news agency that the Barcelona attack was carried out by “soldiers of the Islamic State” in response to its calls for followers to target countries participating in the coalition trying to drive the extremist group from Syria and Iraq.\n\nIslamic extremists have systematically targeted Europe’s major tourist attractions in recent years. Rented or hijacked vehicles have formed the backbone of a strategy to target the West and its cultural symbols. Barcelona’s Las Ramblas is one of the most popular attractions in a city that swarms with foreign tourists in August.\n\nThe dead and wounded in the two attacks hailed from 34 countries.\n\nSpanish public broadcaster RTVE and other news outlets named one of those detained in the Barcelona attack as Driss Oukabir, a French citizen of Moroccan origin. RTVE reported that Oukabir went to police in Ripoll to report that his identity documents had been stolen. Spanish media said documents with his name were found in the attack van and that he claimed his brother might have stolen them.\n\nCiting police sources, Spain’s RTVE as well as El Pais and TV3 identified the brother, 17-year-old Moussa Oukabir, as the suspected driver of the van. Forn declined to respond to questions about him Friday.\n\n“We don’t know if the driver is still in Barcelona or not, or what direction he fled in,” Forn told SER Radio.\n\nForn said the police were trying to identify the five dead attackers in Cambrils as well as the driver of the Barcelona van.\n\n“There could be more people in Ripoll connected to the group,” he said, adding that the two attacks “follow the same trail. There is a connection.”\n\nRajoy called the killings a “savage terrorist attack” and said Spaniards “are not just united in mourning, but especially in the firm determination to beat those who want to rob us of our values and our way of life.”\n\nBy Friday morning, Las Ramblas promenade had reopened to the public, albeit under heavy surveillance and an unusual quiet.\n\n“It’s sad,” New York tourist John Lanza said, as the family stood outside the gated La Boqueria market. “You can tell it’s obviously quieter than it usually is, but I think people are trying to get on with their lives.”\n\nAt noon Friday, a minute of silence honoring the victims was observed at the Placa Catalunya, near the top of Las Ramblas where the van attack started. The presence of Spain’s king and prime minister alongside Catalonia’s regional authorities marked a rare moment when the question of Catalonian independence — the subject of a proposed Oct. 1 referendum — didn’t divide its people.\n\nRajoy declared three days of national mourning.\n\nSince the Madrid train bombings, the only deadly attacks in Spain had been bombings claimed by the Basque separatist group ETA that killed five people over the past decade. It declared a cease-fire in 2011.\n\n“Unfortunately, Spaniards know the absurd and irrational pain that terrorism causes. We have received blows like this in recent years, but we also know that terrorists can be beaten,” Rajoy said.\n\nHatton reported from Lisbon and Giles reported from Madrid. Albert Stumm and Alex Oller in Barcelona also contributed to this report.",
	"collection_date": "Tue Aug 22 21:54:49 2017",
	"converted_collection_date": "08-22-2017 21:54:49",
	"publish_date": "2017-08-18 00:00:00"
},
{
	"newsId": 5718144575,
	"url": "http://www.chicoer.com/opinion/20170817/byron-york-poll-says-voters-like-trump-backed-immigration-bill",
	"summary": "Some Democrats have been quick to denounce the RAISE Act, the new immigration reform bill proposed by Republican Sens.\nNow, though, a new poll shows broad public support for some of the bill’s key provisions — support that goes far beyond those Americans who voted for Donald Trump.\n“I don’t want to limit legal immigration,” Gang of Eight member Marco Rubio said recently, predicting the new bill will not pass the Senate.\nFellow Gang member Lindsey Graham, from South Carolina, said the bill would be “devastating to our state’s economy.” John McCain, another Gang member, opposes shifting to a high-skilled immigrant force.\nBut if the new poll is correct, the bill’s authors have the voters on their side.",
	"author": [],
	"src": "http://www.chicoer.com/",
	"title": "Byron York: Poll says voters like Trump-backed immigration bill",
	"keywords": ["xenophobic",
	"number",
	"asked",
	"yes",
	"member",
	"trumpbacked",
	"poll",
	"gang",
	"byron",
	"york",
	"legal",
	"bill",
	"immigration",
	"voters",
	"support"],
	"newsText": "Some Democrats have been quick to denounce the RAISE Act, the new immigration reform bill proposed by Republican Sens. Tom Cotton and David Perdue and endorsed by President Trump.\n\n“The Trump, Cotton, Perdue bill is rooted in the same anti-immigrant, xenophobic, and isolationist rhetoric that was a cornerstone of the Trump campaign,” said senior House Democrats John Conyers and Zoe Lofgren.\n\n“A xenophobic half-measure,” added Rep. Ed Markey.\n\n“A play to the xenophobic sentiments that lifted Trump to the presidency,” wrote the Washington Post’s Jennifer Rubin.\n\nNow, though, a new poll shows broad public support for some of the bill’s key provisions — support that goes far beyond those Americans who voted for Donald Trump.\n\nThe poll, from Morning Consult-Politico, asked 1,992 registered voters about the bill’s provisions to 1) allow more high-skilled, and fewer low-skilled, immigrants into the country; 2) install a points-based system by which prospective immigrants would be evaluated on the basis of English proficiency, level of education, and other factors; 3) cap the number of refugees allowed in the U.S. each year; and 4) reduce the total number of immigrants given legal permanent residence in the country to 500,000 from the current one million.\n\nThe pollsters found strong majority support for the first three, and a plurality of support for the fourth.\n\nWhen asked if they support “placing greater emphasis on an applicant’s job skills over their ties to family members in the U.S.,” 56 percent of respondents said yes, while 31 percent said no and 13 percent did not know.\n\nWhen asked if they support “establishing a ‘points system’ that would award points based on criteria such as education, English-language ability, and prospective salary,” 61 percent said yes, while 27 percent said no and 12 percent did not know. (Respondents particularly approved an emphasis on speaking English; when asked if they believe an ability to speak English “should be a factor in determining who is allowed to legally immigrate to the United States,” 62 percent said yes, while 29 percent said no and 10 percent did not know.)\n\nWhen asked if they support “limiting the number of refugees offered permanent residency,” 59 percent said yes, while 31 percent said no and 11 percent did not know.\n\nFinally, when asked if they support “reducing the number of legal immigrants by one-half over the next decade,” 48 percent said yes, while 39 percent said no and 14 percent did not know.\n\nThe part of the bill that would cut the number of legal permanent residents from 1 million to 500,000 per year is the one major component that doesn’t have majority support in the poll, although it has more support than any other option. In the weeks ahead, the bill’s sponsors could either try to build support for that provision or compromise on the total reduction.\n\nAdvertisement\n\nThe Cotton-Perdue bill has of course been slammed by Democrats, but it has also been criticized by the Republicans who wrote the Senate Gang of Eight bill in 2013, the last (unsuccessful) effort to pass comprehensive immigration reform.\n\n“I don’t want to limit legal immigration,” Gang of Eight member Marco Rubio said recently, predicting the new bill will not pass the Senate. Fellow Gang member Lindsey Graham, from South Carolina, said the bill would be “devastating to our state’s economy.” John McCain, another Gang member, opposes shifting to a high-skilled immigrant force. “I think you have to consider that we do want high-tech people, but we also need low-skilled people who will do what Americans won’t do,” McCain said. And the final GOP Gang member, Jeff Flake, who describes elements of the Republican Party as xenophobic and anti-immigrant, said the new bill represents “the wrong direction.”\n\nSuch opinions track those of many Democrats, which will make any path forward in the Senate an uphill climb. But if the new poll is correct, the bill’s authors have the voters on their side.\n\nByron York is chief political correspondent for The Washington Examiner. His syndicated column appears each Friday.",
	"collection_date": "Tue Aug 22 21:55:17 2017",
	"converted_collection_date": "08-22-2017 21:55:17",
	"publish_date": "2017-08-17 00:00:00"
},
{
	"newsId": 5718146043,
	"url": "http://jobview.monster.com/Village-Care-of-King-Licensed-Nursing-Home-Administrator-LNHA-Job-King-NC-US-187703920.aspx",
	"summary": "Licensed Nursing Home Administrator – LNHA Opportunity!\nVillage Care of King is seeking an LNHA!\nAs a Licensed Nursing Home Administrator for Village Care of King, we are not just looking for a clinically sound person, we want someone who fits into our desired culture as well:• Have a POSITIVE, ready-to-help, attitude every day!\nTo qualify for this opportunity all we ask is that you:• Must have 1 to 2 years’ experience as a Nursing Home Administrator or supervisory experience.\n• Must be a Licensed Nursing Home Administrator, with the license in good standing, in the State in which you are operating in.",
	"author": [],
	"src": "http://www.chicoer.com/",
	"title": "Saber Healthcare Job Application for Village Care of King - Licensed Nursing Home Administrator - LNHA",
	"keywords": ["state",
	"work",
	"saber",
	"healthcare",
	"nursing",
	"staff",
	"care",
	"job",
	"facility",
	"lnha",
	"application",
	"village",
	"administrator",
	"king",
	"licensed"],
	"newsText": "Licensed Nursing Home Administrator – LNHA Opportunity!\n\n\n\n\n\n\n\nVillage Care of King is seeking an LNHA!\n\nWhat Village Care of King has to offer - YOU - the employee:\n\n• Competitive pay rates\n\n•Performance Based Bonus\n\n• Paid Orientation/Training\n\n• Referral Bonuses\n\n• Employee Recognition Programs\n\n• A great work environment\n\n• Supportive staff and management teams\n\n• Saber Foundation – Donates to AHA, ALZ FDN, ACS, and many more!\n\n• Ever changing and growing organization\n\n• Many opportunities to advance and grow in the organization\n\n• Facilities located throughout the country – easy to transfer\n\n• Job Stability – Work with people who have been with us for years!\n\n\n\n\n\nAs a Licensed Nursing Home Administrator for Village Care of King, we are not just looking for a clinically sound person, we want someone who fits into our desired culture as well:\n\n• Have a POSITIVE, ready-to-help, attitude every day!\n\n• Lead the facility management staff and consultants in developing and working from a company/facility business plan that focuses on all aspects of the facility operations\n\n• Hires all department manager position, ensure that they receive the training needed to be successful in their job\n\n• Rounds frequently throughout the facility to monitor the delivery of nursing care, overall cleanliness and appearance of the facility\n\n• Exhibits and promotes a positive customer service relationship to both internal as well as external customers\n\n• Meet regularly with the residents of the facility to ensure that they are satisfied with the delivery of care\n\n• Ensures that company consultants and other support resources are appropriately utilized and a high level of interdepartmental teamwork is maintained\n\n• Be a team player!!\n\n\n\n\n\nTo qualify for this opportunity all we ask is that you:\n\n• Must have 1 to 2 years’ experience as a Nursing Home Administrator or supervisory experience.\n\n• Must be a Licensed Nursing Home Administrator, with the license in good standing, in the State in which you are operating in. Must have knowledge of state guidelines/ regulations in which you are practicing.",
	"collection_date": "Wed Aug 23 14:03:59 2017",
	"converted_collection_date": "08-23-2017 14:03:59",
	"publish_date": "None"
},
{
	"newsId": 5718148135,
	"url": "http://www.chicoer.com/general-news/20170824/permit-approved-for-controversial-right-wing-rally-in-san-francisco",
	"summary": "In this Nov. 25, 2014 file photo, a group of people on rental bicycles ride past Crissy Field toward the Golden Gate Bridge in San Francisco.\nFederal authorities have approved a politically conservative group’s application to hold a rally at Crissy Field in San Francisco on Saturday, Aug. 26, 2017.\nThe Oath Keepers, a conservative militia group, have said they will send members to the San Francisco rally.\n“We can’t rewrite the Constitution,” said San Francisco police Chief Bill Scott.\nNearly every San Francisco police officer will be on duty on Saturday.",
	"author": ["Casey Tolan"],
	"src": "http://www.chicoer.com/",
	"title": "Permit approved for controversial right-wing rally in San Francisco",
	"keywords": ["park",
	"guns",
	"event",
	"francisco",
	"controversial",
	"crissy",
	"permit",
	"approved",
	"patriot",
	"rally",
	"field",
	"rightwing",
	"san"],
	"newsText": "In this Nov. 25, 2014 file photo, a group of people on rental bicycles ride past Crissy Field toward the Golden Gate Bridge in San Francisco. Federal authorities have approved a politically conservative group’s application to hold a rally at Crissy Field in San Francisco on Saturday, Aug. 26, 2017. But the National Park Service has banned guns, tiki torches and other weapons. AP Photo — Eric Risberg\n\nSAN FRANCISCO >> The National Park Service gave final approval Wednesday for a controversial right-wing rally at San Francisco’s Crissy Field on Saturday afternoon, setting the stage for a weekend of potential clashes in the Bay Area.\n\nThe 2 p.m. rally, which local leaders have described as a “white nationalist” event but organizers say is intended simply to promote free speech, was signed off on by the Golden Gate National Recreation Area.\n\n“We cannot deny a permit to anyone planning to exercise their First Amendment rights based on their political stance or beliefs,” Acting General Superintendent Cicely Muldoon said in a statement.\n\nA permit for the rally was rubber-stamped earlier this month, but park officials reviewed their decision after politicians such as House Minority Leader Nancy Pelosi, California Sen. Dianne Feinstein and San Francisco Mayor Ed Lee objected, saying the rally could lead to deadly violence like that in Charlottesville, Virginia.\n\nPrevious events organized by the same Portland-based group, Patriot Prayer, have attracted white nationalist contingents and devolved into violence. The Oath Keepers, a conservative militia group, have said they will send members to the San Francisco rally.\n\nJoey Gibson, the founder of Patriot Prayer and the organizer of the rally, said he denounced racism and wouldn’t allow any extremists into his event. The permit approval, Gibson told this news organization, was a sign that “the First Amendment will be respected.”\n\nIn a news conference at City Hall on Wednesday, Lee said he was “deeply disappointed” in the decision. “The shameful, anti-American trend of hate-filled extremist rallies will unfortunately be allowed to continue this weekend in our city,” he said.\n\nMuldoon said that after consulting with law enforcement, parks officials determined that protesters would come to Crissy Field on Saturday whether a permit was issued or not — and that issuing a permit would help maintain order. The permit was issued “with significant conditions to promote the peaceful, non-violent expression of views,” Muldoon said.\n\nAccording to the permit conditions, prohibited items in the rally area include guns, weapons of any kind, explosives, toy guns, helmets, drones, mace, pepper spray and selfie sticks.\n\nAdvertisement\n\nBut people with California concealed weapons permits will still be allowed to bring guns onto federal property outside the permitted areas. “We can’t rewrite the Constitution,” said San Francisco police Chief Bill Scott.\n\nPolice are preparing a muscular response to what could be hundreds or thousands of demonstrators and counter-protesters converging on Crissy Field. Nearly every San Francisco police officer will be on duty on Saturday.\n\nPermits were also issued for four other events in the park on Friday and Saturday, which appear to be vigils and rallies opposed to the Patriot Prayer event. Another counter-protest sponsored by city officials is planned across town at Civic Center Plaza on the same day\n\n“Do not engage with the members of this group, whose only priority is to incite violence through divisive rhetoric,” Lee said.\n\nA second “free speech” rally will be held Sunday in Berkeley’s Civic Center Park. That event has not received a permit, and no one has applied for a permit for it, according to Berkeley officials.\n\nMeanwhile, San Franciscans opposed to the right-wing rally have also come up with other creative — and smelly — ways of fighting back. A popular Facebook event has encouraged locals to take their dogs to Crissy Field and let them poop there in the days leading up to Patriot Prayer’s event.\n\nAs of Wednesday afternoon, 885 people marked themselves as “going” to that event — more than double the number of people who’ve signed up to say they’re going to the rally itself.\n\nContact Casey Tolan at 510-208-6425.",
	"collection_date": "Thu Aug 24 16:02:30 2017",
	"converted_collection_date": "08-24-2017 16:02:30",
	"publish_date": "2017-08-24 00:00:00"
},
{
	"newsId": 5718151436,
	"url": "http://www.chicoer.com/business/20170825/today-in-history",
	"summary": "In 1964, President Lyndon B. Johnson was nominated for a term of office in his own right at the Democratic National Convention in Atlantic City, New Jersey.\nIn 1996, Democrats opened their 42nd national convention in Chicago.\nFive years ago: In the face of approaching Tropical Storm Isaac, Republicans pushed back the start of their national convention in Tampa, Florida, by a day.\nRock musician Dan Vickrey (Counting Crowes) is 51.\nRock musician Adrian Young (No Doubt) is 48.",
	"author": ["The Associated Press"],
	"src": "http://www.chicoer.com/",
	"title": "Today in History",
	"keywords": ["singer",
	"musician",
	"actor",
	"station",
	"national",
	"convention",
	"rock",
	"today",
	"won",
	"victory",
	"shot",
	"history"],
	"newsText": "Today in History\n\nToday is Saturday, Aug. 26, the 238th day of 2017. There are 127 days left in the year.\n\nToday's Highlight in History:\n\nOn August 26, 1920, the 19th Amendment to the U.S. Constitution, guaranteeing American women's right to vote, was certified in effect by Secretary of State Bainbridge Colby.\n\nAdvertisement\n\nOn this date:\n\nIn 1789, France's National Assembly adopted its Declaration of the Rights of Man and of the Citizen.\n\nIn 1817, the University of Michigan was founded.\n\nIn 1939, the first televised major league baseball games were shown on experimental station W2XBS: a double-header between the Cincinnati Reds and the Brooklyn Dodgers at Ebbets Field. (The Reds won the first game, 5-2, the Dodgers the second, 6-1.)\n\nIn 1944, French Gen. Charles de Gaulle braved the threat of German snipers as he led a victory march in Paris, which had just been liberated by the Allies from Nazi occupation.\n\nIn 1957, the Soviet Union announced it had successfully tested an intercontinental ballistic missile.\n\nIn 1964, President Lyndon B. Johnson was nominated for a term of office in his own right at the Democratic National Convention in Atlantic City, New Jersey.\n\nIn 1968, the Democratic National Convention opened in Chicago; the four-day event that resulted in the nomination of Hubert H. Humphrey for president was marked by a bloody police crackdown on antiwar protesters in the streets.\n\nIn 1972, the summer Olympics games opened in Munich, West Germany.\n\nIn 1978, Cardinal Albino Luciani (al-BEE'-noh loo-CHYAH'-nee) of Venice was elected pope following the death of Paul VI; the new pontiff took the name Pope John Paul I. (However, he died just over a month later.)\n\nIn 1986, in the so-called \"preppie murder case,\" 18-year-old Jennifer Levin was found strangled in New York's Central Park; Robert Chambers later pleaded guilty to manslaughter and served 15 years in prison.\n\nIn 1996, Democrats opened their 42nd national convention in Chicago.\n\nIn 2015, Alison Parker, a reporter for WDBJ-TV in Roanoke, Virginia, and her cameraman, Adam Ward, were shot to death during a live broadcast by a disgruntled former station employee who fatally shot himself while being purused by police.\n\nTen years ago: Iraqi Prime Minister Nouri al-Maliki (NOO'-ree ahl-MAHL'-ih-kee) lashed out at American critics, saying Sen. Hillary Clinton and other Democrats who were calling for his ouster should \"come to their senses\" and stop treating Iraq like \"one of their villages.\" The $95 million Hawaii Superferry made its maiden run from Oahu to Maui, the first passenger ferry service between the islands. (However, the ferry went out of business two years later.) Warner Robins, Georgia, won the Little League World Series title with a 3-2 victory over Tokyo.\n\nFive years ago: In the face of approaching Tropical Storm Isaac, Republicans pushed back the start of their national convention in Tampa, Florida, by a day. Lydia Ko, a 15-year-old South Korean-born New Zealander, won the Canadian Women's Open to become the youngest winner in LPGA Tour history and only the fifth amateur champion. Japan limited Tennessee's potent lineup to two hits in a 12-2 victory in the Little League World Series title game.\n\nOne year ago: San Francisco 49ers quarterback Colin Kaepernick refused to stand for the national anthem before the Niners played host to the Green Bay Packers in an exhibition game, saying he believed the United States was oppressing African Americans and other minorities. (The Packers won, 21-10.) NBA star Dwayne Wade's 32-year-old cousin, Nykea Aldridge, was shot to death while pushing her baby in a stroller near a Chicago school where she intended to register her children; Wade denounced the killing as an \"act of senseless gun violence.\" (Two brothers were charged with Aldridge's slaying.) A SpaceX Dragon capsule returned to Earth with scientific gifts from the International Space Station, parachuting into the Pacific just off Mexico's Baja California coast loaded with 3,000 pounds of research and equipment.\n\nToday's Birthdays: Former Homeland Security Secretary Tom Ridge is 72. Rhythm-and-blues singer Valerie Simpson is 72. Pop singer Bob Cowsill is 68. Broadcast journalist Bill Whitaker is 66. Actor Brett Cullen is 61. NBA coach Stan Van Gundy is 58. Jazz musician Branford Marsalis is 57. Country musician Jimmy Olander (Diamond Rio) is 56. Actor Chris Burke is 52. Actress-singer Shirley Manson (Garbage) is 51. Rock musician Dan Vickrey (Counting Crowes) is 51. TV writer-actress Riley Weston is 51. Rock musician Adrian Young (No Doubt) is 48. Actress Melissa McCarthy is 47. Latin pop singer Thalia is 46. Actress Meredith Eaton is 43. Rock singer-musician Tyler Connolly (Theory of a Deadman) is 42. Actor Mike Colter is 41. Actor Macaulay Culkin is 37. Actor Chris Pine is 37. Actor Johnny Ray Gill is 33. Country singer Brian Kelley (Florida Georgia Line) is 32. Rhythm-and-blues singer Cassie Ventura is 31. Actor Evan Ross is 29. Actor Dylan O'Brien is 26. Actress Keke Palmer is 24.\n\nThought for Today: \"Suffering belongs to no language.\" \u0097 Adelia Prado, Brazilian poet.",
	"collection_date": "Sat Aug 26 05:08:34 2017",
	"converted_collection_date": "08-26-2017 05:08:34",
	"publish_date": "2017-08-25 00:00:00"
},
{
	"newsId": 5718167157,
	"url": "http://www.chicoer.com/arts-and-entertainment/20170903/philadelphia-fetes-benjamin-franklin-parkway-as-it-turns-100",
	"summary": "PHILADELPHIA (AP) \u0097 Philadelphia's grand cultural boulevard, the Benjamin Franklin Parkway, is gearing up for its 100th birthday.\nThe city has a full roster of yearlong celebrations planned for the parkway, starting Sept. 8 and continuing through November 2018, when the Parkway officially turns 100.\n___PERMANENT HIGHLIGHTSThe parkway starts near City Hall and cuts a diagonal swath across the city's grid street pattern, leading to the Philadelphia Museum of Art.\nJust across from City Hall sits Love Park, named after the Robert Indiana sculpture that sits inside.\nToward the art museum at Eakins Oval, a monument of George Washington astride a horse stands atop a fountain portraying Native Americans and animals.",
	"author": ["Kristen De Groot",
	"Associated Press"],
	"src": "http://www.chicoer.com/",
	"title": "Philadelphia fetes Benjamin Franklin Parkway as it turns 100",
	"keywords": ["benjamin",
	"parkway",
	"free",
	"city",
	"sept",
	"created",
	"fetes",
	"philadelphia",
	"museum",
	"hall",
	"100",
	"art",
	"turns",
	"franklin",
	"paul"],
	"newsText": "PHILADELPHIA (AP) \u0097 Philadelphia's grand cultural boulevard, the Benjamin Franklin Parkway, is gearing up for its 100th birthday.\n\nThe mile-long artery connects the city's business district with sprawling Fairmount Park, and is a corridor of world-renowned museums, imposing monuments and splashing fountains.\n\nThe city has a full roster of yearlong celebrations planned for the parkway, starting Sept. 8 and continuing through November 2018, when the Parkway officially turns 100.\n\nSome things to know about one of the nation's earliest showcases of urban renewal:\n\nAdvertisement\n\nHISTORY\n\nAs early as the 1850s, civic organizations, politicians and prominent Philadelphians wanted to create a boulevard to link the heavily industrial city with bucolic Fairmount Park. It was part of the \"City Beautiful\" movement sweeping the nation at the time, a response to overcrowded, tenement-filled neighborhoods. The idea was to use urban planning to create monuments and boulevards, beautifying the city and creating vistas to cultural landmarks, in the spirit of the Champs Elysees in Paris.\n\nPhiladelphia voters approved a loan for the project in 1908 and architects Paul Cret, Clarence Zantzinger and Horace Trumbauer produced the original plan for what was then called the Fairmount Parkway.\n\nAfter delays and politics stalled it for nearly a decade, France-born landscape architect Jacques Greber was assigned to revise the original plan in 1917. More than 1,300 homes and other properties were destroyed to make way for the parkway. After it was completed, The New York Times called the parkway an example of \"civic magnificence.\"\n\n___\n\nPERMANENT HIGHLIGHTS\n\nThe parkway starts near City Hall and cuts a diagonal swath across the city's grid street pattern, leading to the Philadelphia Museum of Art. Museums along the route include the Academy of Natural Sciences, the Barnes Foundation, the Franklin Institute, and the Rodin Museum.\n\nOther architectural highlights include the Cathedral Basilica of Saints Peter and Paul and the Free Library of Philadelphia, with special collections from ancient cuneiform tablets to one of the world's top Charles Dickens collections.\n\nGreen spaces, parks and fountains dot the center line. Just across from City Hall sits Love Park, named after the Robert Indiana sculpture that sits inside. Toward the art museum at Eakins Oval, a monument of George Washington astride a horse stands atop a fountain portraying Native Americans and animals.\n\nArt museum visitors can stand in the Great Stair Hall underneath a mobile created by Alexander \"Sandy\" Calder, and gaze out a window at a Swann Memorial Fountain created by his father Alexander Stirling Calder and behind it, City Hall, crowned with a statue of William Penn created by his grandfather, Alexander Milne Calder.\n\n___\n\nPARKWAY TODAY\n\nThe outdoor staircase to the Philadelphia Museum of Art got its Hollywood close-up in the \"Rocky\" movies, and they're ascended countless times each day by visitors re-creating the fictional boxer's run.\n\nThe parkway's central location and open spaces has led to it becoming a go-to spot for big events. The NFL draft was held on the parkway last spring, with the steps serving as its backdrop. In 2015, Pope Francis celebrated Mass in a similar location during his visit to the city. In 1979, St. John Paul II held Mass on the parkway at Logan Square.\n\nOne of the largest free July Fourth celebrations in the country is held each year on the parkway. The Made in America music festival, curated by Jay Z, is a Labor Day tradition there. It's also the start and finish of the Philadelphia Marathon.\n\nThe popularity of the location, combined with current construction along the parkway, can lead to frequent road closures and blocked sidewalks, frustrating pedestrians and drivers.\n\n___\n\nCELEBRATION PLANS\n\nThe celebration gets started Sept. 8 with a \"cultural crawl\" featuring 100 free activities including museum admission deals, guided tours, crafts and community art projects.\n\nArtist Cai Guo-Qiang has been commissioned to turn the parkway into a dreamscape from Sept. 15 to Oct. 8 with his \"Fireflies\" work. He's created about 900 colorful lanterns in whimsical shapes like emojis, hamburgers and aliens that will adorn 27 pedicabs. The public can get free nighttime rides around the parkway on these pedicabs, transforming the parkway with the glowing, moving clusters of color.\n\nIn December, artist Jennifer Steinkamp's outdoor installation called \"Winter Fountains for the Parkway\" will illuminate the boulevard with her five \"fountains\" glowing with animated video projections.\n\nOther events include plantings, concerts, and more activities will be announced as the year goes on.\n\nFor the grand finale, museums, institutions and attractions will open their doors to the public on Nov. 16, 2018, for what's being billed as a \"visit-them-all\" experience.",
	"collection_date": "Sun Sep  3 14:01:53 2017",
	"converted_collection_date": "09-03-2017 14:01:53",
	"publish_date": "2017-09-03 00:00:00"
},
{
	"newsId": 5718173084,
	"url": "http://www.chicoer.com/arts-and-entertainment/20170906/radiolands-fall-fantasia-brings-back-what-radio-once-was",
	"summary": "Evenings were spent with adults and children curled comfortably into soft chairs, or lying on carpeted floors, around the radio.\nFrom Sept. 7 through Oct. 1, Radioland’s Fall Fantasia,” a third in the TOTR Radioland series, will present a homage to the “Fallidays.”TOTR artistic director Jerry Miller, writer and director of this new extravaganza, is assisted by Patrick Brown with 1950s costumes by Lupe Fischer.\n“It’s the same format as our other Radioland shows,” Miller said, “but everything is geared for fall which covers Halloween and Thanksgiving.\n“We will have a new series called ‘The British Bulldogs, Stiffy and Bing.’“As a writer, my inspirations are from the old radio shows from the ’40s and ’50s,” Miller said.\nGet a hilarious start on the new fall season live entertainment by coming to see this exemplary show of earlier days in radio.",
	"author": ["Verda Mackay"],
	"src": "http://www.chicoer.com/",
	"title": "Radioland’s Fall Fantasia brings back what radio once was",
	"keywords": ["radios",
	"shows",
	"fall",
	"miller",
	"radiolands",
	"radio",
	"writer",
	"fantasia",
	"patrick",
	"series",
	"singers",
	"radioland",
	"brings"],
	"newsText": "Paradise >> Back in the 1940s and ’50s, known as the Golden Age of Radio, people eagerly gathered around their radios to hear the next episode of exciting stories.\n\nEvenings were spent with adults and children curled comfortably into soft chairs, or lying on carpeted floors, around the radio. Imaginations could run wild as they listened to the adventures of the airwave characters.\n\nTheatre on the Ridge invites audiences to relive those days as they watch another salute to the programs of yesteryear.\n\nFrom Sept. 7 through Oct. 1, Radioland’s Fall Fantasia,” a third in the TOTR Radioland series, will present a homage to the “Fallidays.”\n\nTOTR artistic director Jerry Miller, writer and director of this new extravaganza, is assisted by Patrick Brown with 1950s costumes by Lupe Fischer.\n\n“It’s the same format as our other Radioland shows,” Miller said, “but everything is geared for fall which covers Halloween and Thanksgiving.\n\n“The music is mostly from the ’40s to — well, we’ve got a few surprises in there,” he said. “We will have a new series called ‘The British Bulldogs, Stiffy and Bing.’\n\n“As a writer, my inspirations are from the old radio shows from the ’40s and ’50s,” Miller said. “My favorite part of the show is writing the commercials. In the 1950s they were often politically incorrect, and today are almost all a parody.”\n\nJohn Mereck performs the role of MC Phil Gilders. The house singers for the radios station, “The Sophisticates,” are ‘falltastically’ sung by Steve “Obe” Oberlander, Karen Fox, Teresa Miller and Christopher Scott.\n\nThis Radioland show will have all the excited serials which include “The Scarlet Ranger!,” “Zap Flannigan”, “Spacekateer” and the favorite quiz show “Beat the Stars.”\n\nEric Rickets portrays host Professor Dieter Von Drake in “Beat the Stars.” Kelly Oberlander is the hostess Frau Prinzegenentorte.\n\nThree people will be picked from the audience to compete in this part of the show. They have a real chance to win prizes. The host and hostess will interview people before the show and select those they think would be fun contestants.\n\nThe Caukaisers, a German family act, is played by Shaunna Jones, Judy Clemens, Christopher Jones and Terra Jones.\n\nAdded to the array of talented actors and singers are featured artists Rex King (Bill Petree), Rosa Delgado (Mercedes Macias) and Dottie West (Sierra Mills).\n\nAdvertisement\n\nEvery radio program needs excellent sound effects. Patrick Brown and Addison Turner are the Foley artists.\n\nGet a hilarious start on the new fall season live entertainment by coming to see this exemplary show of earlier days in radio.\n\nTickets are $16 general, $20 reserved, $22 at the door. Special discounts nights are only $12 at the door.\n\nTicket outlets are Hair, Body & Soul,1600 Magrove Ave., Chico and Fir Street Gifts, 6256 Skyway, Paradise.",
	"collection_date": "Wed Sep  6 17:04:18 2017",
	"converted_collection_date": "09-06-2017 17:04:18",
	"publish_date": "2017-09-06 00:00:00"
},
{
	"newsId": 5718180551,
	"url": "http://www.chicoer.com/general-news/20170908/for-trump-and-ryan-a-tortured-relationship-grows-more-so",
	"summary": "Now the tortured relationship between President Donald Trump and House Speaker Paul Ryan has gone cool again, with the Republican president making clear he has no qualms about bucking the GOP leader to cut deals with his Democratic foes.\nTrump exulted in his newly bipartisan approach Thursday, declaring it “a great thing for our country,” while Ryan mostly grinned and bore it.\nIt also underscored the political pressure on Ryan to try to remain in the president’s good graces even when Trump is flirting with Democrats.\nGOP health care efforts collapsed in the Senate in July.\nRyan’s position is seen as secure for now, if only because it is widely accepted that no other House Republican could garner the support needed to replace him.",
	"author": ["Erica Werner",
	"Jonathan Lemire",
	"The Associated Press"],
	"src": "http://www.chicoer.com/",
	"title": "For Trump and Ryan, a tortured relationship grows more so",
	"keywords": ["senate",
	"gop",
	"speaker",
	"ryan",
	"republican",
	"tortured",
	"care",
	"trump",
	"health",
	"relationship",
	"president",
	"grows",
	"house"],
	"newsText": "WASHINGTON >> It started out cold as ice, and then turned warm and friendly. Now the tortured relationship between President Donald Trump and House Speaker Paul Ryan has gone cool again, with the Republican president making clear he has no qualms about bucking the GOP leader to cut deals with his Democratic foes.\n\nThe two men dined at the White House Thursday night and discussed legislative challenges ahead for the fall, a get-together that was scheduled over Congress’ August recess, long before the head-spinning events of this week. In a moment that stunned Washington, Trump cut a debt and disaster aid deal Wednesday with Congress’ Democratic leaders as Ryan and Senate Majority Leader Mitch McConnell watched on helplessly, after lobbying unsuccessfully for much different terms.\n\nThe moment distilled the inherent tensions between Trump, 71, a former Democrat and ideologically flexible deal-maker, and Ryan, 47, a loyal Republican whose discomfort with Trump led him to withhold his endorsement for weeks last year.\n\nAfter Trump was elected the two papered over their differences and even developed a rapport, talking frequently during health care negotiations earlier this year, as each understood they needed the other to advance individual and shared goals. But their phone calls have tapered off of late and Trump has expressed his frustration with GOP leaders on multiple fronts, culminating in the president’s decision to ditch them and join hands with the Democrats instead.\n\nTrump exulted in his newly bipartisan approach Thursday, declaring it “a great thing for our country,” while Ryan mostly grinned and bore it.\n\nAt the Capitol on Wednesday, Ryan had deemed a three-month debt ceiling increase as “unworkable” and “ridiculous.” Yet an hour later, Trump overruled his strong objections to side with the Democrats.\n\nThe president’s rebuff on the debt came just days after Trump ignored Ryan’s pleas not to end the program to aid immigrants brought to the country as children and living here illegally. Instead, Trump ended the program and tossed the issue to Congress to resolve in six months.\n\nThe debt deal headed for House passage Friday along with $15 billion in disaster aid and a three-month government funding extension.\n\nIndeed for Ryan, GOP reactions to the deal exposed some lurking threats to his perch atop a conference where unrest brews nearly ceaselessly among conservatives, and there have been recent rumblings of a possible coup.\n\nTrump remains highly popular in the conservative districts occupied by many House Republicans, much more so than Ryan himself, who is scorned by many in the GOP base as an establishment sell-out. In a whipsawed moment, some House Republicans defended Trump’s handling of a deal they don’t like, while simultaneously criticizing Ryan, who had been overruled by the president. It also underscored the political pressure on Ryan to try to remain in the president’s good graces even when Trump is flirting with Democrats.\n\nAdvertisement\n\nRep. Steve King, R-Iowa, said the message in his conservative district is that “congressional Republicans need to get behind the president.”\n\nThat sentiment “makes him weaker,” King said of Ryan.\n\nRep. Paul Gosar of Arizona described Ryan as “very unpopular” in his district, while regard for Trump is “pretty high.”\n\nAs far as his constituents are concerned, Gosar said, they’d be happy if Ryan got the boot and Trump stayed. “That’s kind of the mantra in my district,” he said.\n\nFor his part, Trump has soured on the Republican congressional leadership in recent months, fuming to associates that they led him astray on their health care strategy, among other complaints.\n\nThe president has told those close to him that he regrets choosing to tackle the repeal and replace of Barack Obama’s health care law as his first legislative push. He has singled out Ryan for blame, saying the speaker assured him it would pass and instead handed him an early, humiliating failure, before ultimate House passage of a revived bill, according to three White House and outside advisers familiar with the conversations but not authorized to speak about them publicly.\n\nGOP health care efforts collapsed in the Senate in July.\n\nTrump has spoken to Ryan less frequently in recent weeks, particularly after the departure of his first chief of staff, Reince Priebus, who has deep Wisconsin ties to the speaker. Priebus would sometimes broker the calls and stress to each man their importance, according to two people familiar with the conversations. Those calls have occurred less often since John Kelly took over as chief of staff.\n\nThough Trump has expressed particular anger at McConnell for the failed Senate health care vote and for not protecting him from the Russia investigation, he grudgingly has told associates that he is aware of the Senate leader’s grip on power. He has spoken less glowingly about Ryan’s own ability to lead due to the shorter House terms and the growing insurgency within the conservative Freedom Caucus.\n\nRyan’s position is seen as secure for now, if only because it is widely accepted that no other House Republican could garner the support needed to replace him. But even allies believe his tenure in the job could be finite, and might depend in part on the whims of a president with whom he has no real deep ties.\n\n“I think any speaker is going to have a very difficult time in this environment,” said Rep. Tom Reed, R-N.Y. “The nature of that job, I think, over time, they don’t last.”\n\nLemire reported from New York.",
	"collection_date": "Fri Sep  8 15:03:15 2017",
	"converted_collection_date": "09-08-2017 15:03:15",
	"publish_date": "2017-09-08 00:00:00"
},
{
	"newsId": 5718185372,
	"url": "http://www.chicoer.com/opinion/20170910/ruben-navarrette-dreamers-debacle-leaves-plenty-of-anger-to-go-around",
	"summary": "Now, in the deepest cut, the White House has ended the program known as Deferred Action for Childhood Arrivals.\nBut the same president who appeared to defend white racists at Charlottesville sees red when it comes to brown people.\nTrump will never be remembered by history as a great president; he’s too small, weak, petty and thin-skinned.\nDACA was only intended to do one thing: Put young people on a bus or plane to their home country.\nAnd instead of an elitist giveaway to Dreamers, we need a remedy that extends to their parents.",
	"author": [],
	"src": "http://www.chicoer.com/",
	"title": "Ruben Navarrette: Dreamers debacle leaves plenty of anger to go around",
	"keywords": ["obama",
	"white",
	"deferred",
	"world",
	"young",
	"undocumented",
	"anger",
	"ruben",
	"plenty",
	"country",
	"leaves",
	"debacle",
	"trump",
	"dreamers",
	"navarrette",
	"daca",
	"president"],
	"newsText": "For writers, happiness is overrated. Some of the best columns have been fueled by anger.\n\nAnd now that President Donald Trump has turned upside down the lives of about 800,000 hardworking but undocumented young people — all by springing a trap set by his predecessor, Barack Obama, to win re-election in 2012 — I have plenty of anger to go around.\n\nAbove all, I’m angry with Trump. Whether he is calling Mexican immigrants criminals, or questioning whether a “Mexican” federal judge born in the United States can adjudicate fairly, or pardoning retired Sheriff Joe Arpaio after the lawman-turned-outlaw defied a federal court order and continued to profile Latinos, this president seems to enjoy inflicting pain and humiliation on America’s largest minority.\n\nNow, in the deepest cut, the White House has ended the program known as Deferred Action for Childhood Arrivals. Congress has six months to find a solution that allows recipients to stay in the country legally.\n\nI’m no psychiatrist. But the same president who appeared to defend white racists at Charlottesville sees red when it comes to brown people.\n\nTrump will never be remembered by history as a great president; he’s too small, weak, petty and thin-skinned. But he may well go down as the most brazenly anti-Latino president in the last 60 years.\n\nThanks to Hurricane Donald, the GOP now stands accused of — as NBC News veteran Tom Brokaw put it — “declaring war on Hispanics in this country.” On MSNBC’s “Morning Joe,” where the liberal hosts seem to care more about defending immigrants since Trump became president, Brokaw called the termination of DACA “a continuation of the Republican determination to cut out Hispanic votes on their side, for as long as we can see.”\n\nIn the new horror movie “It,” there is that moment when a group of kids realize that a clown is evil.\n\nFor Dreamers — who came here as children and, intent on conquering the world, became better at being “American” than the native-born, who think the world owes them a living — that moment came this week when the clown in the Oval Office showed his teeth.\n\nMeanwhile, let’s not forget the accomplice. Trump may have fired the shot but it was Obama who loaded the gun.\n\nHalf a million undocumented young people who wanted to believe that this country loved them half as much as they loved the country put their trust in the pretty words of a president who sprinkled them like fertilizer. In exchange for a two-year work permit, and a chance to prove themselves to America, they foolishly handed over to Immigration and Customs Enforcement their fingerprints, home addresses and the names of undocumented family members.\n\nAdvertisement\n\nGood plan. What could go wrong? This time bomb was bound to explode. That was the idea.\n\nStick with me. The D in DACA stands for “deferred.” What is being deferred? Despite what some wildly misinformed elements of the Latino left tried to tell me this week, it was never legalization. It was always deportation. It’s baffling to me that there are liberals who are so eager to praise Obama that they actually believe that DACA put young people on a path to citizenship.\n\nThat’s idiotic. DACA was only intended to do one thing: Put young people on a bus or plane to their home country. In fact, when you think about it, those 800,000 young people who enrolled are already in ICE custody. They’re just on a temporary furlough.\n\nWe might as well add them to the tally of the 3 million people that Obama deported the old-fashioned way to alleviate the anxiety of African-Americans and white union members who aren’t up to the task of competing with foreign workers.\n\nAmericans are right to be angry. Let’s channel that anger into something positive. We need something that DACA wasn’t: a permanent legislative solution. And instead of an elitist giveaway to Dreamers, we need a remedy that extends to their parents. And we needed it, oh, about five years ago.\n\nRuben Navarrette’s email address is ruben@rubennavarrette.com. Charles Krauthammer, our regular Monday columnist, is on leave.",
	"collection_date": "Mon Sep 11 06:04:33 2017",
	"converted_collection_date": "09-11-2017 06:04:33",
	"publish_date": "2017-09-10 00:00:00"
},
{
	"newsId": 5718196260,
	"url": "http://www.chicoer.com/business/20170916/california-legislators-focus-on-climate-immigration-roads",
	"summary": "They headed home Friday for the year having reauthorized a major climate change-fighting initiative and hiking taxes to pay for road and bridge repairs.\nBut the Legislature did send Brown two bills that would lighten criminal penalties for young offenders.\nIMMIGRATIONThe centerpiece of California's effort to push back against Trump's immigration policies is a plan to limit cooperation of local and state law enforcement with federal immigration agents.\nUnder other immigration bills awaiting Brown's action, immigration officials would need warrants to enter college campuses or work places.\nA bill headed to Brown would let Californians choose the third gender option of \"non-binary\" on driver's licenses and other state documents.",
	"author": ["Jonathan J. Cooper And Don Thompson",
	"Associated Press"],
	"src": "http://www.chicoer.com/",
	"title": "California legislators focus on climate, immigration, roads",
	"keywords": ["lawmakers",
	"bill",
	"plan",
	"immigration",
	"bills",
	"legislators",
	"legislature",
	"california",
	"roads",
	"state",
	"focus",
	"brown",
	"health",
	"repairs",
	"climate",
	"states"],
	"newsText": "SACRAMENTO, Calif. (AP) \u0097 California's Democratically-controlled Legislature kicked off 2017 pledging to stand strong against Republican President Donald Trump and pursue a liberal slate of policies on everything from climate change to health care.\n\nThey headed home Friday for the year having reauthorized a major climate change-fighting initiative and hiking taxes to pay for road and bridge repairs. But a proposal to provide universal health care coverage for Californians fell by the wayside.\n\nDemocratic Gov. Jerry Brown has until Oct. 15 to sign legislation.\n\nHere's a look at what lawmakers did \u0097 or didn't do \u0097 this year.\n\nAdvertisement\n\nENVIRONMENT\n\nLawmakers gave another decade of life to California's cap-and-trade program, the centerpiece of the state's effort to curb greenhouse gas emissions.\n\nThe measure passed with bipartisan support, ultimately costing Assembly Republican Leader Chad Mayes his job following an insurrection from party activists. Environmental justice groups, meanwhile, argued it was too generous to oil companies. They weren't mollified by companion legislation to address toxic air around oil refineries.\n\nCap and trade puts limit on carbon emissions and requires polluters to obtain permits to release greenhouse gases under the cap. Some permits are auctioned off, providing billions of dollars in state revenue. Lawmakers voted to spend $1.5 billion of that money on electric vehicle rebates, cleaner trucks and buses and other initiatives to reduce pollution.\n\nROAD REPAIRS \u0097 AND A TAX HIKE\n\nAfter years of failed attempts to address much-needed road repairs across California, lawmakers voted to increase the gas tax to generate $5 billion a year.\n\nGas prices will rise 12 cents per gallon in November and 19.5 cents by 2020. Diesel taxes will increase 20 cents, and drivers will pay a new vehicle registration fee ranging from $25 to $175 depending on the value of their vehicles.\n\nThe money pays primarily for road repairs, not new or expanded highways, though some of it will also fund transit, parks and other projects.\n\nThe tax increase is at the center of an attempt by Republicans to recall Democratic Sen. Josh Newman, who supported it.\n\nHEALTH CARE\n\nAssembly Speaker Anthony Rendon, D-Paramount, faced a backlash when he shelved a plan to eliminate health insurance coverage and provide government-funded health care for everyone in California.\n\nRendon said the proposal, which did not have a plan to raise the estimated $400 billion per year that it would cost, was not fully developed. He's since formed a special committee to explore universal health coverage.\n\nMeanwhile, the Legislature approved a drug-price transparency bill that had stalled for two years. It requires pharmaceutical companies to provide advance notice before instituting large price increases. The bill is awaiting a signature or veto from Brown.\n\nLAW ENFORCEMENT\n\nLawmakers failed to act on one of their highest-profile law enforcement issues: changing a money bail system that critics say disproportionately punishes poor defendants. They plan to try again next year.\n\nBut the Legislature did send Brown two bills that would lighten criminal penalties for young offenders. One would bar sentencing juveniles to life without parole, in keeping with recent U.S. Supreme Court rulings. The other would expand the state's youthful parole program by requiring parole consideration for offenders who committed their crimes before age 25, up from age 23 in current law.\n\nAnother would write into state law a federal court order that requires officials to consider releasing inmates age 60 or older who have served at least 25 years in prison, excluding death row and other no-parole inmates along with police killers and third-strike career criminals.\n\nOther bills would restrict employers from asking about prior criminal convictions on job applications, allow juvenile offenders to ask a judge to seal records of crimes committed before turning 17 and end additional three-year sentence for repeat drug offenders.\n\nIMMIGRATION\n\nThe centerpiece of California's effort to push back against Trump's immigration policies is a plan to limit cooperation of local and state law enforcement with federal immigration agents. Dubbed a \"sanctuary state\" proposal, it passed the Legislature late Friday and heads to Brown for signature.\n\nUnder other immigration bills awaiting Brown's action, immigration officials would need warrants to enter college campuses or work places. And lawmakers approved $30 million in legal and college financial aid for participants in a program that gives temporary legal protection to young immigrants brought to the United States illegally as children or by parents who overstayed visas.\n\nHOUSING\n\nA package of bills to address the state's affordable housing crisis likewise cleared the Legislature at the last minute, with Brown planning to sign them. The three key bills will place a $4 billion housing bond on the 2018 ballot, streamline development approval in communities that aren't meeting housing goals, and add a $75 fee on real estate transaction documents.\n\nCalifornia is home to many of the nation's most expensive rental markets, and demand for housing outpaces supply by about 1.5 million homes.\n\nOTHERS\n\nPeople who don't pay traffic fines will no longer face a suspension of their driver's license under a budget bill signed by Brown. That's one of a handful of bills passed this year aimed at eliminating fines that disproportionately harm poor people.\n\nA bill headed to Brown would let Californians choose the third gender option of \"non-binary\" on driver's licenses and other state documents. Lawmakers also sent the governor a bill to ban pet stores from selling dogs, cats and rabbits bred at mass-breeding operations, instead requiring them to work with animal shelters and rescue operations.\n\nAn effort to push back middle and high school start times to 8:30 a.m. or later also failed to pass, but will be addressed next year.\n\n___\n\nAssociated Press writer Kathleen Ronayne contributed reporting.",
	"collection_date": "Sat Sep 16 23:02:51 2017",
	"converted_collection_date": "09-16-2017 23:02:51",
	"publish_date": "2017-09-16 00:00:00"
},
{
	"newsId": 5718199347,
	"url": "http://jobview.monster.com/IT-Risk-Assurance-Advisor-Risk-Assurance-Manager-Multiple-Positions-Job-Boston-MA-US-188549965.aspx",
	"summary": "IT Risk Assurance Advisor, Risk Assurance (Manager) (Multiple Positions), Ernst & Young U.S. LLP, Boston, MAFull Job Title: IT Risk Assurance Advisor, Risk Assurance (Manager): Help clients assess and mitigate their Information Technology (IT)-related risks around their business systems and processes.\nEvaluate IT and IT-related business process controls to assess and help strengthen internal controls and improve and protect business performance.\nWork on third-party assurance and compliance engagements; IT governance and effectiveness engagements; IT program management and assurance engagements; IT application risks and controls assessments; and business intelligence and information analysis.\nAlternatively, will accept a Master’s degree in Business, Accounting, Finance, Computer Science, Information Systems, Engineering or a related field and 4 years of related work experience.\nMust have 4 years of work experience with a mid-to-large size public accounting firm, professional consulting firm, or within industry.",
	"author": [],
	"src": "http://www.chicoer.com/",
	"title": "IT Risk Assurance Advisor, Risk Assurance (Manager) (Multiple Positions) job at Ernst & Young U.S. LLP",
	"keywords": ["assurance",
	"engagements",
	"experience",
	"itrelated",
	"risk",
	"positions",
	"job",
	"ernst",
	"information",
	"controls",
	"young",
	"related",
	"multiple",
	"business",
	"manager",
	"work",
	"llp",
	"advisor"],
	"newsText": "IT Risk Assurance Advisor, Risk Assurance (Manager) (Multiple Positions), Ernst & Young U.S. LLP, Boston, MA\n\nFull Job Title: IT Risk Assurance Advisor, Risk Assurance (Manager): Help clients assess and mitigate their Information Technology (IT)-related risks around their business systems and processes. Evaluate IT and IT-related business process controls to assess and help strengthen internal controls and improve and protect business performance. Work on financial audit engagements to assess IT-related internal controls over financial statement reporting. Work on third-party assurance and compliance engagements; IT governance and effectiveness engagements; IT program management and assurance engagements; IT application risks and controls assessments; and business intelligence and information analysis. Collect and analyze data to detect unmitigated risks, identify deficient controls, duplicated effort, or non-compliance with laws, regulations, and management policies.\n\nManage and motivate teams of professionals with diverse skills and backgrounds. Consistently deliver quality client services by monitoring progress. Demonstrate in-depth technical capabilities, industry sector understanding and professional knowledge. Maintain long-term client relationships and networks. Cultivate business development opportunities.\n\nMINIMUM REQUIREMENTS:\n\n\n\nMust have a Bachelor’s degree in Business, Accounting, Finance, Computer Science, Information Systems, Engineering or a related field and 5 years of progressive, post-baccalaureate related work experience. Alternatively, will accept a Master’s degree in Business, Accounting, Finance, Computer Science, Information Systems, Engineering or a related field and 4 years of related work experience.\n\n\n\nMust have 4 years of experience applying relevant technical knowledge to one of the following engagements: financial statement audits; IT-related internal or operational audits; service organization controls reporting engagements; and/or ERP security and controls reviews (Oracle, SAP, PeopleSoft).\n\n\n\nMust have 4 years of work experience with a mid-to-large size public accounting firm, professional consulting firm, or within industry.\n\nMust have 1 year of experience in project management, preparing and delivering reports, and giving presentations to clients.\n\nMust be eligible to obtain CPA, CA, CISA, CIPP, CBCP, CGEIT, CFE, CIA, CISSP, CISM, CIPT and/or CMA certification within one year of hire.\n\nRequires travel up to 50%, of which 15% may be international, to serve client needs.\n\nAny suitable combination of education, training, or experience is acceptable.\n\nFor complete job description, list of requirements, and to apply, go to: ey.com/us/jobsearch (Job #BOS002SH).",
	"collection_date": "Mon Sep 18 02:04:10 2017",
	"converted_collection_date": "09-18-2017 02:04:10",
	"publish_date": "None"
},
{
	"newsId": 5718199755,
	"url": "http://jobview.monster.com/Financial-Advisor-Transaction-Advisory-Services-Operational-Transaction-Services-M-A-Finance-Job-New-York-NY-US-188550457.aspx",
	"summary": "Financial Advisor, Transaction Advisory Services (Operational Transaction Services - M&A - Finance) (Senior Manager) (Multiple Positions), Ernst & Young U.S. LLP, New York, NY.\nServe as an Operational Transaction Services professional to prepare and execute integration, divestiture and/or carve out plans to maximize synergies and financial benefits from transactions focusing on the finance function.\nLead client engagement teams executing Operational Transaction Services which support key financial executives in developing and executing their transaction strategy to secure deal value.\nManage risk in the delivery of quality client services.\nMust have 4 years of experience in one of the following: financial reporting, financial planning, order-to-cash, or purchase-to-pay.",
	"author": [],
	"src": "http://www.chicoer.com/",
	"title": "Financial Advisor, Transaction Advisory Services (Operational Transaction Services - M&A - Finance) job at Ernst & Young U.S. LLP",
	"keywords": ["ernst",
	"experience",
	"client",
	"job",
	"ma",
	"financial",
	"young",
	"business",
	"integration",
	"operational",
	"related",
	"transaction",
	"services",
	"teams",
	"llp",
	"finance"],
	"newsText": "Financial Advisor, Transaction Advisory Services (Operational Transaction Services - M&A - Finance) (Senior Manager) (Multiple Positions), Ernst & Young U.S. LLP, New York, NY.\n\nServe as an Operational Transaction Services professional to prepare and execute integration, divestiture and/or carve out plans to maximize synergies and financial benefits from transactions focusing on the finance function. Lead client engagement teams executing Operational Transaction Services which support key financial executives in developing and executing their transaction strategy to secure deal value. Demonstrate advanced knowledge of all phases and aspects of methodology across integrations, divestitures, carve-outs, and other types of transaction engagements. Demonstrate strong transaction knowledge in one or more key industry (e.g., manufacturing, life sciences, consumer product goods, industrial products, technology, retail, etc.) and Finance and Accounting. Oversee the identification of risks and issues related to integration planning, timelines and functional areas and demonstrate the ability to recommend resolutions for these risks and issues.\n\n\n\nLead and direct teams of professionals with diverse skills and backgrounds by providing constructive on-the-job feedback/coaching to team members. Develop and maintain long-term client relationships and networks. Manage risk in the delivery of quality client services. Generate and manage new business opportunities.\n\nMINIMUM REQUIREMENTS:\n\n\n\nBachelor's degree in business, accounting, finance, engineering, computer science or related field plus 8 years of experience (of which 5 years are post-bachelor's, progressive related work experience). Alternatively, will accept a Master's degree in business, accounting, finance, engineering, computer science or related field plus 7 years of related work experience.\n\n\n\nMust have 6 years of experience in making detailed assessments of the finance function, of which 4 years should be for the integration or separation of client operations.\n\n\n\n\n\nMust have 6 years of experience in financial process benchmarking, finance organization design, process redesign, shared services, process outsourcing or transition service agreements (TSA).\n\n\n\n\n\nMust have 4 years of mergers and acquisitions experience in a consulting environment.\n\n\n\n\n\nMust have 4 years of experience in business integrations, divestitures, or carve-outs including experience with quantitative and qualitative analysis.\n\n\n\n\n\nMust have 4 years of experience in one of the following: financial reporting, financial planning, order-to-cash, or purchase-to-pay.\n\n\n\n\n\nMust have 2 years of experience managing engagements and engagement related budgets; and, leading teams, including projects and engagement leadership, goal setting, and performance reviews.\n\n\n\n\n\nMust have 2 years of experience in synthesizing approaches in complex integration or divestiture conflicts.\n\n\n\nMust have 2 years of experience with financial information systems such as SAP, Oracle, Hyperion, Cognos and/or other common systems.\n\nWillingness and ability to travel up to 80%, may be national or international.\n\nEmployer will accept any suitable combination of education, training or experience.\n\nTO APPLY: Please apply on-line at\n\ney.com/us/jobsearch (Job Number –\n\nNEW00IVB\n\n).",
	"collection_date": "Mon Sep 18 04:06:09 2017",
	"converted_collection_date": "09-18-2017 04:06:09",
	"publish_date": "None"
},
{
	"newsId": 5718207185,
	"url": "http://www.chicoer.com/general-news/20170921/one-girls-dramatic-rescue-emblematic-of-mexico-earthquake-rush-to-save-survivors",
	"summary": "A rescuer pulls a dog out of the rubble during the search Wednesday in Mexico City.\nThe rest were in Mexico State, which borders Mexico City on three sides, Guerrero and Oaxaca states, according to the official Twitter feed of civil defense agency head Luis Felipe Puente.\nIn the town of Jojutla, dozens of buildings collapsed, including the town hall.\nMayor Miguel Angel Mancera said there were 38 collapsed buildings in the capital alone, down from the 44 he had announced previously.\nPeople rallied to help their neighbors in a huge volunteer effort that included people from all walks of life in Mexico City, where social classes seldom mix.",
	"author": ["Christopher Sherman",
	"Peter Orsi",
	"Mark Stevenson",
	"The Associated Press"],
	"src": "http://www.chicoer.com/",
	"title": "One girl’s dramatic rescue emblematic of Mexico earthquake rush to save survivors",
	"keywords": ["girls",
	"collapsed",
	"earthquake",
	"mexico",
	"quake",
	"city",
	"workers",
	"emblematic",
	"rescue",
	"survivors",
	"rush",
	"dramatic",
	"rubble",
	"state",
	"school",
	"buildings",
	"save"],
	"newsText": "A rescuer pulls a dog out of the rubble during the search Wednesday in Mexico City. At least 100 people died in the nation’s capital after the 7.1 quake. YURI CORTEZ — Getty Images\n\nMEXICO CITY >> The wiggling fingers of a young girl trapped in the rubble of her collapsed school in Mexico City raised hopes among hundreds of rescuers working furiously Wednesday to try to free her — a drama that played out at dozens of buildings toppled by the powerful earthquake that killed at least 230 people.\n\nBut it was the rescue operation at the Enrique Rebsamen school, where 25 people including 21 children perished, that was seen as emblematic of Mexicans’ rush to save survivors before time runs out.\n\nHelmeted workers spotted the girl buried in the debris early Wednesday and shouted to her to move her hand if she could hear. She did, and a rescue dog was sent inside to confirm she was alive.\n\nHours later the crews were still laboring to free her, as images of the rescue effort were broadcast on TV screens nationwide. Workers in neon vests and helmets used ropes, pry-bars and other tools, frequently calling on the anxious parents and others gathered around to be silent while they listened for any other voices from beneath the school.\n\nAt one point, the workers lowered a sensitive microphone inside the rubble to scan for any noise or movement. A rescuer said they thought they had located someone, but it wasn’t clear who.\n\n“It would appear they are continuing to find children,” said Carlos Licona, a burly sledge-hammer wielding volunteer who came to help in any way he could. Asked if that made him optimistic, he said, “I hope so.”\n\nIt was part of similar efforts at the scenes of dozens of collapsed buildings, where firefighters, police, soldiers and civilians wore themselves out hammering, shoveling, pushing and pulling debris aside to try to reach the living and the dead.\n\nBy mid-afternoon, 52 people had been pulled out alive since Tuesday’s magnitude 7.1 quake, Mexico City’s Social Development Department said, adding in a tweet: “We won’t stop.” Among them were 11 people rescued at the Enrique Rebsamen school, where three people remained missing, two children and an adult. Earlier, journalists saw rescuers pull two small bodies from the rubble, covered in sheets.\n\nMore than 24 hours after the collapse, the debris being removed from the school began to change as crews worked their way inside: from huge chunks of brick and concrete, to pieces of wood that looked like remnants of desks and paneling, to a final load that contained a half dozen sparkly hula-hoops.\n\nAdvertisement\n\nA volunteer rescue worker, Dr. Pedro Serrano, managed to crawl into the crevices of the tottering pile of rubble and make it to a classroom, where he found no survivors.\n\n“We saw some chairs and wooden tables. The next thing we saw was a leg, and then we started to move rubble and we found a girl and two adults — a woman and a man,” he said. All were dead.\n\n“We can hear small noises, but we don’t know if they’re coming from ... the walls above, or someone below calling for help,” Serrano said.\n\nA helicopter overflight of some of the worst-hit buildings revealed the extent of the damage wrought by the quake: three mid-rise apartment buildings on the same street pancaked and toppled in one Mexico City neighborhood; dozens of streets in the town of Jojutla, in Morelos state, where nearly every home was flattened or severely damaged; and a ruined church where 12 people died inside.\n\nThe death toll included 100 people killed in Mexico City, 69 in Morelos state just south of the capital and 43 in Puebla state to the southeast, where the quake was centered. The rest were in Mexico State, which borders Mexico City on three sides, Guerrero and Oaxaca states, according to the official Twitter feed of civil defense agency head Luis Felipe Puente.\n\nPresident Enrique Pena Nieto declared three days of mourning even as authorities made rescuing the trapped and treating the wounded their priority. “Every minute counts to save lives,” Pena Nieto tweeted.\n\nIn the town of Jojutla, dozens of buildings collapsed, including the town hall. One building was rocked off its foundations and part way into a river.\n\nThe town’s Instituto Morelos secondary school partly collapsed, but an earthquake drill held Tuesday morning to mark the anniversary of an 8.0 earthquake that killed thousands in 1985 proved fortuitous, the school’s director, Adelina Anzures said.\n\n“I told them that it was not a game, that we should be prepared,” Anzures said of the drill. When the quake hit, she said, children and teachers rapidly filed out and nobody was hurt.\n\nTown residents who had spent Tuesday night on the streets next to homes that were severely damaged or flattened outright, wrapped in blankets or on mattresses, walked past shattered buildings and picked through what was left when daylight came\n\n“It was an ugly and horrible experience. Our house used to be two floors and it ended up ... a total loss. I thank God that my 83-year-old mother, my daughter-in-law with her baby, we all escaped with scratches,” said Maria Elena Vargas, 54, adding that everything they had was in the rubble.\n\n“I hope that the government helps us because this block is destroyed, that they do not just profit from others’ pain. ... Now we have to lift ourselves up, with or without the government,” Vargas added.\n\nAt a wake for Daniel Novoa, killed when his home collapsed, family members bent over a white child-size coffin surrounded by a crucifix and images of Mexico’s patron, the Virgin of Guadalupe. Alongside was a larger open coffin for the child’s aunt, Marta Cruz.\n\nPena Nieto visited Jojutla and said brigades would be going door-to-door to make sure homes are safe.\n\nIn Atzala in Puebla state, villagers mourned 11 family members who died inside a church when it crumbled during a baptism for a 2-year-old girl. People at the wake said the only ones to survive were the baby’s father, the priest and the priest’s assistant.\n\nPower was being restored in some Mexico City neighborhoods that had been left in darkness overnight, and officials reported that the sprawling Metro system was running at near-normal capacity. Mayor Miguel Angel Mancera said there were 38 collapsed buildings in the capital alone, down from the 44 he had announced previously.\n\nPeople rallied to help their neighbors in a huge volunteer effort that included people from all walks of life in Mexico City, where social classes seldom mix. Doctors, dentists and lawyers stood alongside construction workers and street sweepers, handing buckets of debris or chunks of concrete hand-to-hand down the line.\n\nEven Mexico City’s normally raucous motorcycle clubs swung into action, using motorcades to open lanes for emergency vehicles on avenues crammed with cars largely immobilized by street closures and malfunctioning stoplights.\n\nEconomist Alfredo Coutino, Latin America director for Moody’s Analytics warned Wednesday of economic disruption to several central states and the capital in particular.\n\n“Though it is too early for authorities to have an estimate of the damage as rescue work continues, it is certain that economic activity ... will continue to be disrupted for some time,” Coutino wrote.\n\nAssociated Press writer Carlos Rodriguez in Jojutla contributed to this report.",
	"collection_date": "Thu Sep 21 15:05:14 2017",
	"converted_collection_date": "09-21-2017 15:05:14",
	"publish_date": "2017-09-21 00:00:00"
},
{
	"newsId": 5718209858,
	"url": "http://www.chicoer.com/general-news/20170922/the-latest-police-student-died-after-night-of-drinking",
	"summary": "(AP) \u0097 The Latest on the death of a Louisiana State University student in a possible fraternity hazing incident (all times local):4 p.m.A police report says a Louisiana State University student who died last week had been found \"unresponsive\" at a fraternity house after a night of drinking there.\nLSU officials said last week that police were investigating the Sept. 14 death of 18-year-old Maxwell Gruver as a possible result of fraternity hazing.\nLSU President F. King Alexander said last week that police were investigating allegations that alcohol was a factor in Gruver's death.\nPolice are investigating the Sept. 14 death of 18-year-old Maxwell Gruver as a possible result of fraternity hazing.\nThe fraternity's national office closed the chapter after Gruver's death.",
	"author": [],
	"src": "http://www.chicoer.com/",
	"title": "The Latest: Police: Student died after night of drinking",
	"keywords": ["latest",
	"fraternity",
	"hazing",
	"gruvers",
	"student",
	"university",
	"gruver",
	"death",
	"state",
	"drinking",
	"report",
	"night",
	"died",
	"week",
	"possible"],
	"newsText": "BATON ROUGE, La. (AP) \u0097 The Latest on the death of a Louisiana State University student in a possible fraternity hazing incident (all times local):\n\n4 p.m.\n\nA police report says a Louisiana State University student who died last week had been found \"unresponsive\" at a fraternity house after a night of drinking there.\n\nLSU officials said last week that police were investigating the Sept. 14 death of 18-year-old Maxwell Gruver as a possible result of fraternity hazing. Last Friday, a coroner said hospital tests found a \"highly elevated\" blood-alcohol level in Gruver's body.\n\nAdvertisement\n\nGruver's name is redacted from the one-page police report that LSU released Friday. The report indicates Gruver was driven in a \"private vehicle\" to the hospital where he was pronounced dead.\n\nLSU President F. King Alexander said last week that police were investigating allegations that alcohol was a factor in Gruver's death. The report doesn't elaborate on the circumstances that led to Gruver being found at the Phi Delta Theta fraternity house.\n\n___\n\n10:30 a.m.\n\nLouisiana Gov. John Bel Edwards has asked leaders of the state's system of universities and colleges to review their campus policies on hazing, alcohol and drugs following the death of a Louisiana State University student.\n\nIn a letter dated Thursday, Edwards asked system presidents to report their findings and recommendations to his office by Oct. 29.\n\nPolice are investigating the Sept. 14 death of 18-year-old Maxwell Gruver as a possible result of fraternity hazing. A coroner said hospital tests found a \"highly elevated\" blood alcohol level in Gruver's body.\n\nThe LSU freshman from Roswell, Georgia, was being considered for membership in the Phi Delta Theta fraternity.\n\nThe fraternity's national office closed the chapter after Gruver's death.",
	"collection_date": "Fri Sep 22 22:03:46 2017",
	"converted_collection_date": "09-22-2017 22:03:46",
	"publish_date": "2017-09-22 00:00:00"
},
{
	"newsId": 5718209976,
	"url": "http://www.chicoer.com/social-affairs/20170922/chico-area-church-services",
	"summary": "Chico Grace Brethren Church: 355 Panama Ave.: “Watering Hope: Confidence,” we can grow in hostile places, from Pastor Matthew Raley, 10:15 a.m. Scripture: 2 Corinthians 3:4-6.\nFirst Baptist Church: 850 Palmetto Ave.: Worship with message, “God’s Not Fair!,” 10:30 a.m. Scripture: Matthew 20:1-16.\nVespers in the Valley: affiliated with Ridge Presbyterian Church (Paradise), meets at New Hope Fellowship Church, 418 W. Seventh St. at Normal: Worship service with message from Assoc.\nORLANDFederated Church of Orland: 709 First St.: Worship, 10:30 a.m.\nHarvest Baptist Church: 1202 Railroad Ave.: Worship services, 10:30 a.m. and 1 p.m. Sundays and 6 p.m. Wednesdays.",
	"author": [],
	"src": "http://www.chicoer.com/",
	"title": "Chico area church services",
	"keywords": ["area",
	"1030",
	"chico",
	"rev",
	"pastor",
	"st",
	"church",
	"road",
	"ave",
	"services",
	"scripture",
	"service",
	"worship"],
	"newsText": "Saturday services\n\nCHICO\n\nCalvary Chapel of Chico: 1888 Springfield Drive: “Fearless,” from Pastor Justin Morris, 6 p.m. Scripture: John 4:18.\n\nCongregation Beth Israel: 1336 Hemlock St.: Torah Study, 9 a.m., followed by Torah service, 10 a.m.\n\nIglesia Adventista del Septimo Dia: 3612 Hicks Lane: Divine worship, 10 a.m.\n\nOur Divine Savior Catholic Church: 566 E. Lassen Ave.: Mass; 5 p.m. Rev. R. Francis Stevenson. Scripture: Isaiah 55:6-9, Psalm 145:2-3, 8-9, 17-18, Philippians 1:20c-24, 27a, Matthew 20:1-16a..\n\nSaints Cyril and Methodius Orthodox Christian Church: 2956 Cohasset Road: Great Vespers; 6 p.m.\n\nSt. John the Baptist Catholic Church: 416 Chestnut St.: Vigil Mass; 5 p.m. English, 7 p.m. Spanish. Rev. Jason Clark.\n\nPARADISE\n\nSt. Thomas More Catholic Church: 767 Elliot Road: Mass, 8:30 a.m. Vigil for Sunday Mass; 5 p.m. Father Joseph Michael Baricvatro, presider.\n\nSunday services\n\nCHICO\n\nAldersgate United Methodist Church: 2869 Cohasset Road: “God Spoke ... to a Gentile???,” from Pastor Scott Allred, 9 a.m. contemporary with Praise Team and 11 a.m. traditional with Choir. Scripture: Acts 10:9023.\n\nBidwell Presbyterian Church: 208 W. First St.: “The First Step Toward One-Anothering One Another,” from the series, “An Uncommon Fellowship: A Deeper Community and Heart of Faith,” 8:30 a.m. traditional, 9:45 and 11:11 a.m. contemporary and 10:30 a.m. Bidwell at 131 W. First St. Scripture: John 13:31-35, Romans 15:7-13.\n\nButte Bible Fellowship: 2255 Pillsbury Road: “The Beauty of Heaven,” from guest speaker Isaac Schaeffer, 10:15 a.m. “Essentials: The Gospel of Jesus Christ 1,” from Pastor Bruce Gilbert, 6 p.m.\n\nCalvary Chapel of Chico: 1888 Springfield Drive: “Fearless,” from Pastor Justin Morris, 9 and 11 a.m. Scripture: John 4:18.\n\nCenter for Spiritual Living Chico: 14 Hillary Lane: Meditation service with guide Conne Asquith, 9:30 a.m. “The Power of Imagination,” from the Rev. Kathy Fernandes, 10 a.m. with Spirit Choir. Both based on the monthly theme, “Inspiration Through Imagination.”\n\nChico Bible Church: 175 Chico Canyon Road: “Life in theSpirit,” from Pastor Kirk Belben, 10 a.m. Scripture: Romans 8:1-39 (part 2).\n\nAdvertisement\n\nChico Bible Fellowship: 1505 Arbutus Ave.: “Seven Days with John the Revelator, Day 2 ... Church!,” 10 a.m.\n\nChico Friends Meeting (Quakers): 1601 Hemlock St.: Adult Education, 9 a.m.; Inter-generational singing at 9:45 a.m., followed by unprogrammed Quaker meeting for worship and youth program, 10:30 a.m. All are welcome.\n\nChico Grace Brethren Church: 355 Panama Ave.: “Watering Hope: Confidence,” we can grow in hostile places, from Pastor Matthew Raley, 10:15 a.m. Scripture: 2 Corinthians 3:4-6. “The Life of Christ in Harmony,” Life Builder service, 6 p.m.\n\nChrist International Fellowship: Meets at Chico Community Guild, 2775 Nord Ave.: “Peter’s Miraculous Escape From Prison,” from Pastor Roger Scalice, 10 a.m. Scripture: Acts 12.\n\nChristian Science Church: 770 Palmetto Ave.: “Reality,” 10 a.m. Scripture: Psalms 119:12, 18.\n\nChurch of Christ: 995 E. Lassen Ave.: “Students of Christ,” From Jamie Morris, 10:30 a.m.\n\nChurch On The Esplanade: 1119 The Esplanade: “A Royal ‘Waste’ of Time,” from Pastor Ed Pincusoff, 11 a.m. Scripture: John 12:1-8.\n\nCovenant Reformed Church: Adventist building, 1877 Hooker Oak Ave.: “Heidelberg Confession Question 104: What Does God Require in the Fifth Commandment?,” 10:30 a.m. Scripture: Ephesians 6:1-6.\n\nEvangelical Free Church: 1193 Filbert Ave.: “It’s Time to Open My Heart to Those in Need,” from the series, “Game On: Living Life to Win!,” from Pastor Lou Diaz, 8:15 a.m. blended and 11:15 a.m. contemporary. Scripture: Luke 10:25-37.\n\nFaith Lutheran Church: 667 E. First Ave.: Worship with message from Pastor Bill Kees on the 16th Sunday after Pentecost, 9:30 a.m. with Holy Communion. Scripture: matthew 20:1-16.\n\nFirst Baptist Church: 850 Palmetto Ave.: Worship with message, “God’s Not Fair!,” 10:30 a.m. Scripture: Matthew 20:1-16.\n\nGrace Bible Church: 275 Fairchild Ave., Suite 103, by Chico Airport: Worship with message from Pastor Miguel Rivera, 10:30 a.m.\n\nGrace Community Church: 2346 Floral Ave.: “Power Tools,” part 2 in the series, “Gospel Fluency,” 9 and 10:45 a.m.\n\nLife Church: 1492 East Ave.: Worship with message from Pastor Jeff Young, 10 a.m.\n\nNeighborhood Church: 2801 Notre Dame Blvd.: “Miracle of Oil,” from the series, “Elisha,” from Andrew Burchett, 9 and 11 a.m. in the dome.\n\nNew Beginnings Fellowship: 1183 Benatar Way, Suite C: Worship service, 10:30 a.m.\n\nNewman Catholic Center: 346 Cherry St.: Student Mass, 7 p.m.\n\nOur Divine Savior Catholic Church: 566 E. Lassen Ave.: Masses; 7:30, 9 and 11 a.m. Rev. R. Francis Stevenson. Scripture: Isaiah 55:6-9, Psalm 145:2-3, 8-9, 17-18, Philippians 1:20c-24, 27a, Matthew 20:1-16a.\n\nRedeemer Evangelical Lutheran (LCMS): Moss and Hawthorne avenues: “The Order of the Cross,” from the Rev. Roy Mason, retired, 10 a.m. Scripture: Isaiah 55:6-9.\n\nSt. Augustine of Canterbury Anglican Church-Traditional: Province of Christ the King, 228 Salem St.: “God Forbid That I Should Glory,” from the Rev. Peter Hansen on the 15th Sunday after Trinity, 8 and 10:30 a.m. with Holy Eucharist. Special reception for newly consecrated Bishop Hansen and his wife, Giti Hansen, at noon.\n\nSt. John the Baptist Catholic Church: 416 Chestnut St.: Masses; 8 and 10 a.m. English; noon Spanish. Life Teen Mass, 5 p.m. Rev. Jason Clark.\n\nSt. John the Evangelist Episcopal Church: 2341 Floral Ave.: Holy Communion, no music, 8 a.m. and Holy Communion with music, 10:15 a.m. Scripture: Jonah 3:10-4:11, Philippians 1:21-30, Matthew 20:1-16.\n\nSaints Cyril and Methodius Orthodox Christian Church: 2956 Cohasset Road: Divine Liturgy, 9 a.m.\n\nSaints of Christ (a Restoration Branch): 3479 Grape Way: Traditional worship services; 11 a.m. on first and third Sundays. Pastor Glenn Drobny.\n\nThe Salvation Army Chico Corps: 567 E. 16th St.: “The Position & Practice of a Follower,” from Lt. Arwyn Rodriguera and Hillary Thompson, 10:45-11:45 a.m. Scripture: Ephesians 1:15-23..\n\nTrinity United Methodist Church: 285 E. Fifth St.: “Everybody’s Least Favorite Bible Story,” from the Rev. David S. Vallelunga, 8:30 and 10:30 a.m. Scripture: Matthew 20:1-16.\n\nUnitarian Universalist Fellowship: an open and affirming church, 1289 Filbert Ave.: A look at Leonard Cohen’s, “I Came so Far for Beauty,” and “A Force for Beauty” by Rev. Amy Carol, from the Rev. Bryan Plude, with Megan Johnson, worship associate, and the Breshear Trio, 10:30 a.m.\n\nVespers in the Valley: affiliated with Ridge Presbyterian Church (Paradise), meets at New Hope Fellowship Church, 418 W. Seventh St. at Normal: Worship service with message from Assoc. Pastor Josh Lee, 5 p.m. in sanctuary. Run weekly.\n\nPARADISE\n\nCalvary Baptist Church: 5850 Clark Road: 9:45 a.m. adult Sunday school. 11 a.m. worship service. 6 p.m. evening service.\n\nChristian Science Church: 5913 Clark Road, Suite D, James Square: Worship service, 10 a.m. Testimony meeting, 7 p.m.\n\nCraig Memorial Congregational Church: 5665 Scottwood Road: Traditional worship service with message from Pastor Andrew McHenry, 10 a.m.\n\nHope Christian Church: 6933 Pentz Road: “The Secrets of Lasting Love,” from the series, “It’s All About Love,” 8:30, 10 and 11:45 a.m.\n\nParadise Ridge Southern Baptist: 6975 Pentz Road: “Getting Ready: Being Ready,” from Pastor Robert Sorensen, 11 a.m. with music by Eldon Ricks. Scripture: 1 Peter 3:13-23. Evening worship with favorite hymns and teaching through the Book of Acts, Chapter 5, 6 p.m.\n\nParadise United Methodist: 6722 Clark Road: “The Most Difficult Teaching to Accept,” from Pastor Bob Chicou, 10 a.m. Scripture: Matthew 20:1-16.\n\nRidge Presbyterian Church: congregation of the Presbyterian Church in America, meets at Paradise Adventist Church, 5720 Academy Dr.: Worship service with message from Pastor Josh Lee, 10:30 a.m.\n\nSt. Nicholas’ Episcopal Church: 5872 Oliver Road: Pastor Ann Sullivan will celebrate and Father Bart Kendrick will preach, 8 a.m. Rite I and 10 a.m. Rite II with Holy Eucharist. Scripture: Exodus 16:2-15, Psalm 105:1-6, 37-45, Philippians 1:21-30, Matthew 20:1-16.\n\nSt. Thomas More Catholic Church: 767 Elliot Road: Masses; 8 and 10:30 a.m. Father Joseph Michael Baricvatro, presider.\n\nVespers in the Valley: affiliated with Ridge Presbyterian Church (Paradise), meets at New Hope Fellowship Church, 418 W. Seventh St. at Normal: Worship service with message from Assoc. Pastor Josh Lee, 5 p.m. in sanctuary.\n\nDURHAM\n\nSt. James Catholic Church: Holland and Faber streets: Mass; 9 a.m. English.\n\nMAGALIA\n\nMagalia Community Church: 13700 Old Skyway: “Peace,” part 2, from Pastor Kevin Lindstrom, 10 a.m. Scripture: Galatians 5:22.\n\nUpper Ridge Seventh-day Adventist Church: 15204 Skyway: Sabbath School, 9:15 a.m. Worship hour with Pastor Rob Kearbey, 10:50 a.m.\n\nFOREST RANCH\n\nForest Ranch Baptist Church: Northeast corner Schott Road and Highway 32: Worship service with message, 11 a.m.\n\nMountain Joy Bible Fellowship: meets at 15522 Nopel Ave.: “The King’s Power,” from Pastor Scott MacKenzie, 10:30 a.m. Scripture: Matthew 9:1-38.\n\nORLAND\n\nFederated Church of Orland: 709 First St.: Worship, 10:30 a.m.\n\nHarvest Baptist Church: 1202 Railroad Ave.: Worship services, 10:30 a.m. and 1 p.m. Sundays and 6 p.m. Wednesdays. Pastor Ben Snodderly.\n\nThe deadline for church briefs and services is 3 p.m. Wednesday prior to publication. Email items to religion@chicoer.com or fax them to 342-3617. Do not send email attachments.",
	"collection_date": "Sat Sep 23 00:03:52 2017",
	"converted_collection_date": "09-23-2017 00:03:52",
	"publish_date": "2017-09-22 00:00:00"
},
{
	"newsId": 5718214765,
	"url": "http://www.chicoer.com/arts-and-entertainment/20170913/world-citizen-eric-bibb-travels-back-to-sierra-nevadas-big-room",
	"summary": "After all, the New York-born singer and guitarist has made his home in Sweden almost all of his adult life.\nHe makes that point clear on his latest album, “Migration Blues,” a 15-song set released in March.\nThe origins of “Migration Blues” lay in the recent Syrian refugee crisis that saw countless thousands of people flee war and destruction and risk their lives in rickety overcrowded boats hoping to cross the Mediterranean.\nLike many, Bibb was touched by this shameful tragedy and, as an émigré himself, he felt kinship and empathized.\nBibb’s performance begins at 7:30 p.m. on Sept. 21 at the Sierra Nevada Big Room.",
	"author": ["Bruce Smith-Peters"],
	"src": "http://www.chicoer.com/",
	"title": "World citizen Eric Bibb travels back to Sierra Nevada’s Big Room",
	"keywords": ["way",
	"musicians",
	"sierra",
	"music",
	"room",
	"eric",
	"nevadas",
	"citizen",
	"inspired",
	"travels",
	"migration",
	"refugees",
	"world",
	"big",
	"blues",
	"collaborating",
	"bibb"],
	"newsText": "Some may consider bluesman Eric Bibb an ex-patriot. After all, the New York-born singer and guitarist has made his home in Sweden almost all of his adult life. But Bibb doesn’t look at it that way. Instead, he sees himself as a citizen of the world. He makes that point clear on his latest album, “Migration Blues,” a 15-song set released in March.\n\nBibb and Canadian multi-instrumentalist Michael Jerome Brown will play selections from the CD and from his extensive catalogue amassed over a 50 year career at the Sierra Nevada Brewing Company’s Big Room on Sept. 21.\n\nThe origins of “Migration Blues” lay in the recent Syrian refugee crisis that saw countless thousands of people flee war and destruction and risk their lives in rickety overcrowded boats hoping to cross the Mediterranean. Like many, Bibb was touched by this shameful tragedy and, as an émigré himself, he felt kinship and empathized.\n\nThe result is the 36th album of his career, built around the theme of human migrations, with fitting covers of Bob Dylan’s “Masters of War” and Woody Guthrie’s “This Land is Your Land.”\n\nAs Bibb wrote on his website, through touring and traveling the world he has been “blessed with countless opportunities to recognize my connectedness to people everywhere. Feeling this connection makes it easier to let go of my pre-conceived notions and prejudices toward people and cultures that are outside of my experience. The way I see it, prejudice towards brothers and sisters who are currently called refugees is the problem. Fear and ignorance are the problems. Refugees are not ‘problems’—they are fellow human beings escaping dire circumstances.”\n\nThis led him to think “about the Great Migration, which saw millions of African Americans leaving the brutal segregation and economic misery of the rural South for the industrial cities of the North.” Making this connection inspired “Migration Blues,” which Bibb hopes will “encourage us all to keep our minds and hearts wide open to the ongoing plight of refugees everywhere. As history shows, we all come from people who, at some time or another, had to move.”\n\nBibb’s own migration was not out of necessity so much as it was wanderlust, leaving New York for Paris in 1970 when he was just 19 years old. But even at that young age he had seen a lot. He’s the son of Leon Bibb, a leading figure on the 1960s New York folk scene. His godfather was the actor/singer/activist Paul Robeson, and his uncle was pianist and composer John Lewis, founder the Modern Jazz Quartet. His parents’ house was bristling with activity where, Bibb recalled “getting to meet Rev. Gary Davis, Dylan, Judy Collins or Odetta had a profound effect on me”.\n\nAdvertisement\n\nIn Europe Bibb met other kindred spirits and expatriates and began his focus on the blues, influenced like many of his generation by Taj Mahal’s efforts to make acoustic blues a source of black pride. And like his mentor, Bibb has linked the blues with music from around the world, collaborating with African musicians like Mamadou Diabate, Solo Cissokho, and Habib Koite as well as with blues players Bonnie Riatt and Charlie Musselwhite among others.\n\n“Music in general I think, for me,” Bibb said in a recent telephone conversation, “is essentially about collaborating one way or another with something else or someone else. I’ve met so many wonderful musicians and been influenced by so many wonderful influences and musicians in my career. Collaborating is not something that I do even consciously. It’s just something that happens naturally for me because I make music and music is often—not always—but often about being inspired by somebody else’s playing.”\n\nOr, as “Migration Blues” shows, it can also be inspired by someone else’s experiences, especially if you’re a citizen of the world.\n\nBibb’s performance begins at 7:30 p.m. on Sept. 21 at the Sierra Nevada Big Room.\n\nFor ticket sales and more information, visit www.sierranevada.com/events or call 892-4647.",
	"collection_date": "Sat Sep 23 12:17:36 2017",
	"converted_collection_date": "09-23-2017 12:17:36",
	"publish_date": "2017-09-13 00:00:00"
},
{
	"newsId": 5718215054,
	"url": "http://www.chicoer.com/20170915/local-roundup-chico-state-mens-soccer-wins-ccaa-opener-prep-football-scores",
	"summary": "The Chico State men’s soccer snapped defending California Collegiate Athletic Association champion UC San Diego’s 18-match home unbeaten streak with a 2–0 victory Friday in the CCAA opener for both teams Friday at Triton Soccer Stadium.\nChico State improved to 3-2-0 with its fifth straight road victory, dating back to last season.\nCollege Women’s SoccerUC San Diego 3, Chico State 0 >> The Wildcats entered Friday riding a three-match winning streak, but a 158-second span of struggles in the first half led to a loss.\nChico State dipped to 3-2-0 with the loss in the California Collegiate Athletic Association opener for both squads.\nTristen Thompson led Chico State (6-5, 0-1 CCAA) with 13 digs.",
	"author": ["Staff Reports"],
	"src": "http://www.chicoer.com/",
	"title": "Local Roundup: Chico State men’s soccer wins CCAA opener; prep football scores",
	"keywords": ["yards",
	"state",
	"kills",
	"prep",
	"scored",
	"scores",
	"roundup",
	"local",
	"chico",
	"defense",
	"mens",
	"season",
	"wins",
	"opener",
	"soccer",
	"san",
	"led",
	"football",
	"touchdown"],
	"newsText": "The Chico State men’s soccer snapped defending California Collegiate Athletic Association champion UC San Diego’s 18-match home unbeaten streak with a 2–0 victory Friday in the CCAA opener for both teams Friday at Triton Soccer Stadium.\n\nDylan Wakefield and Carter Johnson each scored for the first time this season, both set up by a pair of teammates, and the Wildcats’ defense limited the Tritons to a season-low 10 shots.\n\nChico State improved to 3-2-0 with its fifth straight road victory, dating back to last season. UC San Diego, picked to win the CCAA again this season by the conference’s coaches, absorbed its first loss of the season, dipping to 2-1-2.\n\nButte 2, Contra Costa 2 >> Steven Gotelid scored on an assist from Charles Cleyton and Bawe Salehi scored in the 83rd minute on an assist from Ari Naimen to help Butte split one on the road against Contra Costa.\n\nHead coach Ross Sandberg credited Luiggi Bajana, Guilherme Antunes and Jonathan Martinez for their strong defense, and goalkeeper Francisco Noguera had seven saves for the Roadrunners (4-0-3).\n\nCollege Women’s Soccer\n\nUC San Diego 3, Chico State 0 >> The Wildcats entered Friday riding a three-match winning streak, but a 158-second span of struggles in the first half led to a loss.\n\nChico State dipped to 3-2-0 with the loss in the California Collegiate Athletic Association opener for both squads. UC San Diego, which ran the CCAA table unbeaten and untied last season for the first time since Sonoma State in 1998, improved to 4-2-0.\n\nButte 4, Marin 0 >> Neala Cronin, Lexi Fox, Mireya Lopez and Destiny Saelee all scored as the Roadrunners recorded their fourth shut out of the season to beat Marin.\n\nButte (4-3) Head coach Mike O’Malley credited Samantha Ross, Vehliliah Rothenberger and Kate Gnesda for their strong play.\n\nCollege Volleyball\n\nCal State L.A. 3, Chico State 1 >> In a match that featured a combined 108 kills, the visiting Golden Eagles powered their way to a four-set victory, downing the Wildcats 25-17, 25-22, 14-25, 25-20 in their California Collegiate Athletic Association opener.\n\nBekah Boyle led the ’Cats with 13 kills, with Makaela Keeve adding 10 kills and five blocks on the evening. Anna Baytosh and Mckenna LaForge tallied eight and seven kills, respectively, while McKenna Carroll and Nicole Desrochers combined for 47 assists. Tristen Thompson led Chico State (6-5, 0-1 CCAA) with 13 digs.\n\nAdvertisement\n\nPrep Football\n\nChico 25, Yuba City 6 >> The Panthers got touchdowns from Kavon Samuels and Ty Thomas on the way to beating Yuba City.\n\nYuba City opened the game by going up 6-0, only to have Chico score 25 unanswered points. Samuels’ 35-yard score served as the highlight for the Panthers (3-1).\n\nDurham 20, Colusa 12 >> Nick Murphy, Kyle Sinclear and Colby Del Carlo all scored touchdowns to help Durham (3-) stay unbeaten on the year.\n\nCollin Bill and Nick Smith had eight and 10 tackles on defense for the Trojans, respectively. Conner Poblano made two interceptions while Manny Tovalin had one.\n\nCorning 46, Oroville 7 >> Curtis McCoy scored three times and Noah Peterson scored twice during a big offensive day that led to a win over Oroville for Corning.\n\nQuarterback Devin Toth added both a rushing touchdown for the Cardinals (3-1) as well as a TD pass to Noah Maeder.\n\nGridley 55, Live Oak 0 >> Jorge Moran had touchdown runs of 14 yards and five yards to lead the Bulldogs past Live Oak.\n\nDavis Mardesuch, Kyle Dutra and Brandon Lara also had touchdown runs for Gridley (2-1). Javier Alejo also returned an interception for a touchdown.\n\nLas Plumas 37, Lindhurst 0 >> Dustin Long ran for 101 yards and two scores to help the Thunderbirds win big over Lindhurst.\n\nAustin Downing added 79 yards on the ground and one touchdown, while Jeramiah Havens caught two touchdown passes. Tanner Allen threw both of them while going 6 for 8 with 146 yards through the air.\n\nOn defense, Garrett Mauldin had 10 tackles and Jarett Atteberry had two sacks.\n\nReport scores by calling 896-7779 or emailing sports@chicoer.com. Scores must be reported on day of play by 9:30 p.m. except for Fridays when the deadline is 10:30 p.m.",
	"collection_date": "Sat Sep 23 15:03:37 2017",
	"converted_collection_date": "09-23-2017 15:03:37",
	"publish_date": "2017-09-15 00:00:00"
},
]